const mongoose = require('mongoose');
const connectDB = require('../config/db');
const Test = require('../models/test');

const testData = [
    // 5-сынып
    {
        class: 5,
        testNumber: 1,
        questions: [
            {
                question: "Тышқан қандай құрылғы?",
                options: ["Шығару", "Енгізу", "Жад", "Қуат көзі"],
                correctAnswer: "Енгізу"
            },
            {
                question: "Компьютерді өшіру үшін не істеу керек?",
                options: ["Тек экранды өшіру", "Розеткадан ажырату", "“Өшіру” командасын таңдау", "Қуат батырмасын басу"],
                correctAnswer: "“Өшіру” командасын таңдау"
            },
            {
                question: "Компьютердің негізгі құрылғыларына не жатады?",
                options: ["Пернетақта, монитор, жүйелік блок", "Принтер, сканер, модем", "Бағдарламалар, ойындар", "Сызғыш, қалам, дәптер"],
                correctAnswer: "Пернетақта, монитор, жүйелік блок"
            },
            {
                question: "Бағдарлама дегеніміз не?",
                options: ["Компьютер экраны", "Ақпарат", "Компьютерге не істеу керектігін айтатын нұсқаулық", "Сурет"],
                correctAnswer: "Компьютерге не істеу керектігін айтатын нұсқаулық"
            },
            {
                question: "Қай құрылғы ақпаратты шығару құрылғысы болып табылады?",
                options: ["Тышқан", "Принтер", "Пернетақта", "Микрофон"],
                correctAnswer: "Принтер"
            },
            {
                question: "Paint бағдарламасы не үшін қажет?",
                options: ["Сурет салу", "Музыка тыңдау", "Мәтін теру", "Видео қарау"],
                correctAnswer: "Сурет салу"
            },
            {
                question: "Компьютердің көмегімен не істеуге болады?",
                "options": ["Тек ойын ойнау", "Мәтін теру, сурет салу, есептеу", "Тек сурет салу", "Тек ән тыңдау"],
                "correctAnswer": "Мәтін теру, сурет салу, есептеу"
            },
            {
                "question": "Ақпарат дегеніміз не?",
                "options": ["Есеп", "Деректер мен мағлұматтар", "Бағдарлама", "Компьютер"],
                "correctAnswer": "Деректер мен мағлұматтар"
            },
            {
                "question": "Компьютердің миы деп қай құрылғыны айтамыз?",
                "options": ["Монитор", "Жүйелік блок", "Тышқан", "Принтер"],
                "correctAnswer": "Жүйелік блок"
            },
            {
                "question": "Интернет дегеніміз не?",
                "options": ["Компьютер", "Қағаз кітапхана", "Әлемдік ақпарат желісі", "Телефон"],
                "correctAnswer": "Әлемдік ақпарат желісі"
            },
            {
                "question": "Компьютермен ұзақ жұмыс істегенде не істеу қажет?",
                "options": ["Тамақ жеу", "Демалу", "Ойнау", "Теледидар көру"],
                "correctAnswer": "Демалу"
            },
            {
                "question": "Word бағдарламасында не жасауға болады?",
                "options": ["Сурет салу", "Мәтін теру", "Видео көру", "Музыка тыңдау"],
                "correctAnswer": "Мәтін теру"
            },
            {
                "question": "Пернетақта не үшін қажет?",
                "options": ["Ақпаратты басып шығару үшін", "Ақпаратты енгізу үшін", "Дыбыс шығару үшін", "Компьютерді қосу үшін"],
                "correctAnswer": "Ақпаратты енгізу үшін"
            },
            {
                "question": "Ақпаратты сақтау құрылғысы:",
                "options": ["Монитор", "Дыбыс колонкасы", "Қатты диск", "Микрофон"],
                "correctAnswer": "Қатты диск"
            },
            {
                "question": "Компьютерде жұмыс істеу ережесі:",
                "options": ["Қатты сөйлесу", "Жақсы отыру, көзді демалту", "Экранды ұстап отыру", "Пернетақтаны ұру"],
                "correctAnswer": "Жақсы отыру, көзді демалту"
            }
        ]
    },
    {
        class: 5,
        testNumber: 2,
        questions: [
            {
                question: "Компьютермен ұзақ жұмыс істегенде не істеу қажет?",
                options: ["Тамақ жеу", "Демалу", "Ойнау", "Теледидар көру"],
                correctAnswer: "Демалу"
            },
            {
                question: "Компьютердің миы деп қай құрылғыны айтамыз?",
                options: ["Монитор", "Жүйелік блок", "Тышқан", "Принтер"],
                correctAnswer: "Жүйелік блок"
            },
            {
                question: "Компьютердің көмегімен не істеуге болады?",
                options: ["Тек ойын ойнау", "Мәтін теру, сурет салу, есептеу", "Тек сурет салу", "Тек ән тыңдау"],
                correctAnswer: "Мәтін теру, сурет салу, есептеу"
            },
            {
                question: "Компьютерді өшіру үшін не істеу керек?",
                "options": ["Тек экранды өшіру", "Розеткадан ажырату", "“Өшіру” командасын таңдау", "Қуат батырмасын басу"],
                "correctAnswer": "“Өшіру” командасын таңдау"
            },
            {
                question: "Бағдарлама дегеніміз не?",
                "options": ["Компьютер экраны", "Ақпарат", "Компьютерге не істеу керектігін айтатын нұсқаулық", "Сурет"],
                "correctAnswer": "Компьютерге не істеу керектігін айтатын нұсқаулық"
            },
            {
                question: "Ақпарат дегеніміз не?",
                "options": ["Есеп", "Деректер мен мағлұматтар", "Бағдарлама", "Компьютер"],
                "correctAnswer": "Деректер мен мағлұматтар"
            },
            {
                question: "Қай құрылғы ақпаратты шығару құрылғысы болып табылады?",
                "options": ["Тышқан", "Принтер", "Пернетақта", "Микрофон"],
                "correctAnswer": "Принтер"
            },
            {
                question: "Пернетақта не үшін қажет?",
                "options": ["Ақпаратты басып шығару үшін", "Ақпаратты енгізу үшін", "Дыбыс шығару үшін", "Компьютерді қосу үшін"],
                "correctAnswer": "Ақпаратты енгізу үшін"
            },
            {
                question: "Ақпаратты сақтау құрылғысы:",
                "options": ["Монитор", "Дыбыс колонкасы", "Қатты диск", "Микрофон"],
                "correctAnswer": "Қатты диск"
            },
            {
                question: "Компьютерде жұмыс істеу ережесі:",
                "options": ["Қатты сөйлесу", "Жақсы отыру, көзді демалту", "Экранды ұстап отыру", "Пернетақтаны ұру"],
                "correctAnswer": "Жақсы отыру, көзді демалту"
            },
            {
                question: "Компьютердің негізгі құрылғыларына не жатады?",
                "options": ["Пернетақта, монитор, жүйелік блок", "Принтер, сканер, модем", "Бағдарламалар, ойындар", "Сызғыш, қалам, дәптер"],
                "correctAnswer": "Пернетақта, монитор, жүйелік блок"
            },
            {
                question: "Paint бағдарламасы не үшін қажет?",
                "options": ["Сурет салу", "Музыка тыңдау", "Мәтін теру", "Видео қарау"],
                "correctAnswer": "Сурет салу"
            },
            {
                question: "Тышқан қандай құрылғы?",
                "options": ["Шығару", "Енгізу", "Жад", "Қуат көзі"],
                "correctAnswer": "Енгізу"
            },
            {
                question: "Интернет дегеніміз не?",
                "options": ["Компьютер", "Қағаз кітапхана", "Әлемдік ақпарат желісі", "Телефон"],
                "correctAnswer": "Әлемдік ақпарат желісі"
            },
            {
                question: "Word бағдарламасында не жасауға болады?",
                "options": ["Сурет салу", "Мәтін теру", "Видео көру", "Музыка тыңдау"],
                "correctAnswer": "Мәтін теру"
            }
        ]
    },
    {
        class: 5,
        testNumber: 3,
        questions: [
            {
                question: "Пернетақта не үшін қажет?",
                options: ["Ақпаратты басып шығару үшін", "Ақпаратты енгізу үшін", "Дыбыс шығару үшін", "Компьютерді қосу үшін"],
                correctAnswer: "Ақпаратты енгізу үшін"
            },
            {
                question: "Тышқан қандай құрылғы?",
                "options": ["Шығару", "Енгізу", "Жад", "Қуат көзі"],
                "correctAnswer": "Енгізу"
            },
            {
                question: "Қай құрылғы ақпаратты шығару құрылғысы болып табылады?",
                "options": ["Тышқан", "Принтер", "Пернетақта", "Микрофон"],
                "correctAnswer": "Принтер"
            },
            {
                question: "Интернет дегеніміз не?",
                "options": ["Компьютер", "Қағаз кітапхана", "Әлемдік ақпарат желісі", "Телефон"],
                "correctAnswer": "Әлемдік ақпарат желісі"
            },
            {
                question: "Компьютерде жұмыс істеу ережесі:",
                "options": ["Қатты сөйлесу", "Жақсы отыру, көзді демалту", "Экранды ұстап отыру", "Пернетақтаны ұру"],
                "correctAnswer": "Жақсы отыру, көзді демалту"
            },
            {
                question: "Ақпарат дегеніміз не?",
                "options": ["Есеп", "Деректер мен мағлұматтар", "Бағдарлама", "Компьютер"],
                "correctAnswer": "Деректер мен мағлұматтар"
            },
            {
                question: "Компьютердің көмегімен не істеуге болады?",
                "options": ["Тек ойын ойнау", "Мәтін теру, сурет салу, есептеу", "Тек сурет салу", "Тек ән тыңдау"],
                "correctAnswer": "Мәтін теру, сурет салу, есептеу"
            },
            {
                question: "Word бағдарламасында не жасауға болады?",
                "options": ["Сурет салу", "Мәтін теру", "Видео көру", "Музыка тыңдау"],
                "correctAnswer": "Мәтін теру"
            },
            {
                question: "Paint бағдарламасы не үшін қажет?",
                "options": ["Сурет салу", "Музыка тыңдау", "Мәтін теру", "Видео қарау"],
                "correctAnswer": "Сурет салу"
            },
            {
                question: "Компьютермен ұзақ жұмыс істегенде не істеу қажет?",
                "options": ["Тамақ жеу", "Демалу", "Ойнау", "Теледидар көру"],
                "correctAnswer": "Демалу"
            },
            {
                question: "Компьютерді өшіру үшін не істеу керек?",
                "options": ["Тек экранды өшіру", "Розеткадан ажырату", "“Өшіру” командасын таңдау", "Қуат батырмасын басу"],
                "correctAnswer": "“Өшіру” командасын таңдау"
            },
            {
                question: "Ақпаратты сақтау құрылғысы:",
                "options": ["Монитор", "Дыбыс колонкасы", "Қатты диск", "Микрофон"],
                "correctAnswer": "Қатты диск"
            },
            {
                question: "Компьютердің негізгі құрылғыларына не жатады?",
                "options": ["Пернетақта, монитор, жүйелік блок", "Принтер, сканер, модем", "Бағдарламалар, ойындар", "Сызғыш, қалам, дәптер"],
                "correctAnswer": "Пернетақта, монитор, жүйелік блок"
            },
            {
                question: "Компьютердің миы деп қай құрылғыны айтамыз?",
                "options": ["Монитор", "Жүйелік блок", "Тышқан", "Принтер"],
                "correctAnswer": "Жүйелік блок"
            },
            {
                question: "Бағдарлама дегеніміз не?",
                "options": ["Компьютер экраны", "Ақпарат", "Компьютерге не істеу керектігін айтатын нұсқаулық", "Сурет"],
                "correctAnswer": "Компьютерге не істеу керектігін айтатын нұсқаулық"
            }
        ]
    },
    {
        class: 5,
        testNumber: 4,
        questions: [
            {
                question: "Paint бағдарламасы не үшін қажет?",
                options: ["Сурет салу", "Музыка тыңдау", "Мәтін теру", "Видео қарау"],
                correctAnswer: "Сурет салу"
            },
            {
                question: "Бағдарлама дегеніміз не?",
                "options": ["Компьютер экраны", "Ақпарат", "Компьютерге не істеу керектігін айтатын нұсқаулық", "Сурет"],
                "correctAnswer": "Компьютерге не істеу керектігін айтатын нұсқаулық"
            },
            {
                question: "Ақпарат дегеніміз не?",
                "options": ["Есеп", "Деректер мен мағлұматтар", "Бағдарлама", "Компьютер"],
                "correctAnswer": "Деректер мен мағлұматтар"
            },
            {
                question: "Тышқан қандай құрылғы?",
                "options": ["Шығару", "Енгізу", "Жад", "Қуат көзі"],
                "correctAnswer": "Енгізу"
            },
            {
                question: "Пернетақта не үшін қажет?",
                "options": ["Ақпаратты басып шығару үшін", "Ақпаратты енгізу үшін", "Дыбыс шығару үшін", "Компьютерді қосу үшін"],
                "correctAnswer": "Ақпаратты енгізу үшін"
            },
            {
                question: "Интернет дегеніміз не?",
                "options": ["Компьютер", "Қағаз кітапхана", "Әлемдік ақпарат желісі", "Телефон"],
                "correctAnswer": "Әлемдік ақпарат желісі"
            },
            {
                question: "Word бағдарламасында не жасауға болады?",
                "options": ["Сурет салу", "Мәтін теру", "Видео көру", "Музыка тыңдау"],
                "correctAnswer": "Мәтін теру"
            },
            {
                question: "Компьютерде жұмыс істеу ережесі:",
                "options": ["Қатты сөйлесу", "Жақсы отыру, көзді демалту", "Экранды ұстап отыру", "Пернетақтаны ұру"],
                "correctAnswer": "Жақсы отыру, көзді демалту"
            },
            {
                question: "Компьютердің көмегімен не істеуге болады?",
                "options": ["Тек ойын ойнау", "Мәтін теру, сурет салу, есептеу", "Тек сурет салу", "Тек ән тыңдау"],
                "correctAnswer": "Мәтін теру, сурет салу, есептеу"
            },
            {
                question: "Компьютердің негізгі құрылғыларына не жатады?",
                "options": ["Пернетақта, монитор, жүйелік блок", "Принтер, сканер, модем", "Бағдарламалар, ойындар", "Сызғыш, қалам, дәптер"],
                "correctAnswer": "Пернетақта, монитор, жүйелік блок"
            },
            {
                question: "Компьютермен ұзақ жұмыс істегенде не істеу қажет?",
                "options": ["Тамақ жеу", "Демалу", "Ойнау", "Теледидар көру"],
                "correctAnswer": "Демалу"
            },
            {
                question: "Қай құрылғы ақпаратты шығару құрылғысы болып табылады?",
                "options": ["Тышқан", "Принтер", "Пернетақта", "Микрофон"],
                "correctAnswer": "Принтер"
            },
            {
                question: "Компьютерді өшіру үшін не істеу керек?",
                "options": ["Тек экранды өшіру", "Розеткадан ажырату", "“Өшіру” командасын таңдау", "Қуат батырмасын басу"],
                "correctAnswer": "“Өшіру” командасын таңдау"
            },
            {
                question: "Ақпаратты сақтау құрылғысы:",
                "options": ["Монитор", "Дыбыс колонкасы", "Қатты диск", "Микрофон"],
                "correctAnswer": "Қатты диск"
            },
            {
                question: "Компьютердің миы деп қай құрылғыны айтамыз?",
                "options": ["Монитор", "Жүйелік блок", "Тышқан", "Принтер"],
                "correctAnswer": "Жүйелік блок"
            }
        ]
    },
    {
        class: 5,
        testNumber: 5,
        questions: [
            {
                question: "Тышқан қандай құрылғы?",
                "options": ["Шығару", "Енгізу", "Жад", "Қуат көзі"],
                "correctAnswer": "Енгізу"
            },
            {
                question: "Интернет дегеніміз не?",
                "options": ["Компьютер", "Қағаз кітапхана", "Әлемдік ақпарат желісі", "Телефон"],
                "correctAnswer": "Әлемдік ақпарат желісі"
            },
            {
                question: "Компьютерді өшіру үшін не істеу керек?",
                "options": ["Тек экранды өшіру", "Розеткадан ажырату", "“Өшіру” командасын таңдау", "Қуат батырмасын басу"],
                "correctAnswer": "“Өшіру” командасын таңдау"
            },
            {
                question: "Компьютердің миы деп қай құрылғыны айтамыз?",
                "options": ["Монитор", "Жүйелік блок", "Тышқан", "Принтер"],
                "correctAnswer": "Жүйелік блок"
            },
            {
                question: "Paint бағдарламасы не үшін қажет?",
                "options": ["Сурет салу", "Музыка тыңдау", "Мәтін теру", "Видео қарау"],
                "correctAnswer": "Сурет салу"
            },
            {
                question: "Компьютерде жұмыс істеу ережесі:",
                "options": ["Қатты сөйлесу", "Жақсы отыру, көзді демалту", "Экранды ұстап отыру", "Пернетақтаны ұру"],
                "correctAnswer": "Жақсы отыру, көзді демалту"
            },
            {
                question: "Компьютердің негізгі құрылғыларына не жатады?",
                "options": ["Пернетақта, монитор, жүйелік блок", "Принтер, сканер, модем", "Бағдарламалар, ойындар", "Сызғыш, қалам, дәптер"],
                "correctAnswer": "Пернетақта, монитор, жүйелік блок"
            },
            {
                question: "Бағдарлама дегеніміз не?",
                "options": ["Компьютер экраны", "Ақпарат", "Компьютерге не істеу керектігін айтатын нұсқаулық", "Сурет"],
                "correctAnswer": "Компьютерге не істеу керектігін айтатын нұсқаулық"
            },
            {
                question: "Word бағдарламасында не жасауға болады?",
                "options": ["Сурет салу", "Мәтін теру", "Видео көру", "Музыка тыңдау"],
                "correctAnswer": "Мәтін теру"
            },
            {
                question: "Қай құрылғы ақпаратты шығару құрылғысы болып табылады?",
                "options": ["Тышқан", "Принтер", "Пернетақта", "Микрофон"],
                "correctAnswer": "Принтер"
            },
            {
                question: "Ақпаратты сақтау құрылғысы:",
                "options": ["Монитор", "Дыбыс колонкасы", "Қатты диск", "Микрофон"],
                "correctAnswer": "Қатты диск"
            },
            {
                question: "Пернетақта не үшін қажет?",
                "options": ["Ақпаратты басып шығару үшін", "Ақпаратты енгізу үшін", "Дыбыс шығару үшін", "Компьютерді қосу үшін"],
                "correctAnswer": "Ақпаратты енгізу үшін"
            },
            {
                question: "Компьютермен ұзақ жұмыс істегенде не істеу қажет?",
                "options": ["Тамақ жеу", "Демалу", "Ойнау", "Теледидар көру"],
                "correctAnswer": "Демалу"
            },
            {
                question: "Компьютердің көмегімен не істеуге болады?",
                "options": ["Тек ойын ойнау", "Мәтін теру, сурет салу, есептеу", "Тек сурет салу", "Тек ән тыңдау"],
                "correctAnswer": "Мәтін теру, сурет салу, есептеу"
            },
            {
                question: "Ақпарат дегеніміз не?",
                "options": ["Есеп", "Деректер мен мағлұматтар", "Бағдарлама", "Компьютер"],
                "correctAnswer": "Деректер мен мағлұматтар"
            }
        ]
    },
    // 6-сынып
    {
        class: 6,
        testNumber: 1,
        questions: [
            {
                question: "Қай құрылғы енгізу құрылғысы болып табылады?",
                options: ["Принтер", "Сканер", "Монитор", "Динамик"],
                correctAnswer: "Сканер"
            },
            {
                question: "Гиперсілтеме дегеніміз не?",
                "options": ["Сурет", "Түс", "Басқа бетке өтетін сілтеме", "Кесте"],
                "correctAnswer": "Басқа бетке өтетін сілтеме"
            },
            {
                question: "Файл дегеніміз не?",
                "options": ["Компьютер", "Программа", "Ақпараттар жиынтығы", "Экран"],
                "correctAnswer": "Ақпараттар жиынтығы"
            },
            {
                question: "Интернет қызметтеріне не жатады?",
                "options": ["Word", "Почта, WWW, FTP", "Paint", "Excel"],
                "correctAnswer": "Почта, WWW, FTP"
            },
            {
                question: "Компьютерлік этика дегеніміз не?",
                "options": ["Бағдарлама түрі", "Қауіпсіздік құралы", "Компьютермен дұрыс жұмыс істеу ережесі", "Дыбыс шығару әдісі"],
                "correctAnswer": "Компьютермен дұрыс жұмыс істеу ережесі"
            },
            {
                question: "Программа не үшін керек?",
                "options": ["Музыка тыңдау үшін", "Компьютермен әрекеттесу үшін", "Кескін салу үшін", "Файл жою үшін"],
                "correctAnswer": "Компьютермен әрекеттесу үшін"
            },
            {
                question: "Компьютерлік желі дегеніміз не?",
                "options": ["Компьютер бағдарламасы", "Компьютерлердің байланысы", "Дыбыс құрылғысы", "Принтердің түрі"],
                "correctAnswer": "Компьютерлердің байланысы"
            },
            {
                question: "Ақпараттың ең кіші өлшем бірлігі:",
                "options": ["Мегабайт", "Бит", "Гигабайт", "Килобайт"],
                "correctAnswer": "Бит"
            },
            {
                question: "Компьютердің жедел жады не үшін қажет?",
                "options": ["Бағдарламаларды ұзақ сақтау үшін", "Процесті баяулату үшін", "Уақытша сақтау үшін", "Сақтау құрылғысын ауыстыру үшін"],
                "correctAnswer": "Уақытша сақтау үшін"
            },
            {
                question: "Ақпараттың өлшем бірліктері:",
                "options": ["Секунд, минут", "Километр, метр", "Бит, байт", "Градус, радиан"],
                "correctAnswer": "Бит, байт"
            },
            {
                question: "Электрондық пошта не үшін қажет?",
                "options": ["Музыка жіберу үшін", "Құжат жазу үшін", "Хат алмасу үшін", "Кескін салу үшін"],
                "correctAnswer": "Хат алмасу үшін"
            },
            {
                question: "Scratch бағдарламасы не үшін қажет?",
                "options": ["Сурет салу", "Код жазу", "Графикалық ойындар жасау", "Мәтін теру"],
                "correctAnswer": "Графикалық ойындар жасау"
            },
            {
                question: "Компьютердің қатты дискі қайда орналасады?",
                "options": ["Монитормен бірге", "Сыртта", "Жүйелік блок ішінде", "Пернетақтада"],
                "correctAnswer": "Жүйелік блок ішінде"
            },
            {
                question: "Компьютерлік вирустар не істей алады?",
                "options": ["Компьютерді тездетеді", "Компьютерді қорғап тұрады", "Файлдарды бүлдіреді", "Байланысты жақсартады"],
                "correctAnswer": "Файлдарды бүлдіреді"
            },
            {
                question: "Алгоритм дегеніміз не?",
                "options": ["Компьютер", "Мәлімет", "Әрекеттер тізбегі", "Графика"],
                "correctAnswer": "Әрекеттер тізбегі"
            }
        ]
    },
    {
        class: 6,
        testNumber: 2,
        questions: [
            {
                question: "Компьютерлік вирустар не істей алады?",
                "options": ["Компьютерді тездетеді", "Компьютерді қорғап тұрады", "Файлдарды бүлдіреді", "Байланысты жақсартады"],
                "correctAnswer": "Файлдарды бүлдіреді"
            },
            {
                question: "Ақпараттың өлшем бірліктері:",
                "options": ["Секунд, минут", "Километр, метр", "Бит, байт", "Градус, радиан"],
                "correctAnswer": "Бит, байт"
            },
            {
                question: "Гиперсілтеме дегеніміз не?",
                "options": ["Сурет", "Түс", "Басқа бетке өтетін сілтеме", "Кесте"],
                "correctAnswer": "Басқа бетке өтетін сілтеме"
            },
            {
                question: "Файл дегеніміз не?",
                "options": ["Компьютер", "Программа", "Ақпараттар жиынтығы", "Экран"],
                "correctAnswer": "Ақпараттар жиынтығы"
            },
            {
                question: "Компьютерлік этика дегеніміз не?",
                "options": ["Бағдарлама түрі", "Қауіпсіздік құралы", "Компьютермен дұрыс жұмыс істеу ережесі", "Дыбыс шығару әдісі"],
                "correctAnswer": "Компьютермен дұрыс жұмыс істеу ережесі"
            },
            {
                question: "Интернет қызметтеріне не жатады?",
                "options": ["Word", "Почта, WWW, FTP", "Paint", "Excel"],
                "correctAnswer": "Почта, WWW, FTP"
            },
            {
                question: "Программа не үшін керек?",
                "options": ["Музыка тыңдау үшін", "Компьютермен әрекеттесу үшін", "Кескін салу үшін", "Файл жою үшін"],
                "correctAnswer": "Компьютермен әрекеттесу үшін"
            },
            {
                question: "Компьютердің жедел жады не үшін қажет?",
                "options": ["Бағдарламаларды ұзақ сақтау үшін", "Процесті баяулату үшін", "Уақытша сақтау үшін", "Сақтау құрылғысын ауыстыру үшін"],
                "correctAnswer": "Уақытша сақтау үшін"
            },
            {
                question: "Электрондық пошта не үшін қажет?",
                "options": ["Музыка жіберу үшін", "Құжат жазу үшін", "Хат алмасу үшін", "Кескін салу үшін"],
                "correctAnswer": "Хат алмасу үшін"
            },
            {
                question: "Ақпараттың ең кіші өлшем бірлігі:",
                "options": ["Мегабайт", "Бит", "Гигабайт", "Килобайт"],
                "correctAnswer": "Бит"
            },
            {
                question: "Компьютердің қатты дискі қайда орналасады?",options: ["Монитормен бірге", "Сыртта", "Жүйелік блок ішінде", "Пернетақтада"],
                correctAnswer: "Жүйелік блок ішінде"
            },
            {
                question: "Компьютерлік этика дегеніміз не?",
                "options": ["Бағдарлама түрі", "Қауіпсіздік құралы", "Компьютермен дұрыс жұмыс істеу ережесі", "Дыбыс шығару әдісі"],
                "correctAnswer": "Компьютермен дұрыс жұмыс істеу ережесі"
            },
            {
                "question": "Ақпараттың өлшем бірліктері:",
                "options": ["Секунд, минут", "Километр, метр", "Бит, байт", "Градус, радиан"],
                "correctAnswer": "Бит, байт"
            },
            {
                "question": "Электрондық пошта не үшін қажет?",
                "options": ["Музыка жіберу үшін", "Құжат жазу үшін", "Хат алмасу үшін", "Кескін салу үшін"],
                "correctAnswer": "Хат алмасу үшін"
            },
            {
                "question": "Қай құрылғы енгізу құрылғысы болып табылады?",
                "options": ["Принтер", "Сканер", "Монитор", "Динамик"],
                "correctAnswer": "Сканер"
            },
            {
                "question": "Ақпараттың ең кіші өлшем бірлігі:",
                "options": ["Мегабайт", "Бит", "Гигабайт", "Килобайт"],
                "correctAnswer": "Бит"
            },
            {
                "question": "Ақпараттың өлшем бірліктері:",
                "options": ["Секунд, минут", "Километр, метр", "Бит, байт", "Градус, радиан"],
                "correctAnswer": "Бит, байт"
            },
            {
                "question": "Гиперсілтеме дегеніміз не?",
                "options": ["Сурет", "Түс", "Басқа бетке өтетін сілтеме", "Кесте"],
                "correctAnswer": "Басқа бетке өтетін сілтеме"
            },
            {
                "question": "Интернет қызметтеріне не жатады?",
                "options": ["Word", "Почта, WWW, FTP", "Paint", "Excel"],
                "correctAnswer": "Почта, WWW, FTP"
            },
            {
                "question": "Scratch бағдарламасы не үшін қажет?",
                "options": ["Сурет салу", "Код жазу", "Графикалық ойындар жасау", "Мәтін теру"],
                "correctAnswer": "Графикалық ойындар жасау"
            }
        ]
    },
    {
        class: 6,
        testNumber: 7,
        questions: [
            {
                question: "Компьютерлік желі дегеніміз не?",
                "options": ["Компьютер бағдарламасы", "Компьютерлердің байланысы", "Дыбыс құрылғысы", "Принтердің түрі"],
                "correctAnswer": "Компьютерлердің байланысы"
            },
            {
                question: "Электрондық пошта не үшін қажет?",
                "options": ["Музыка жіберу үшін", "Құжат жазу үшін", "Хат алмасу үшін", "Кескін салу үшін"],
                "correctAnswer": "Хат алмасу үшін"
            },
            {
                question: "Компьютердің жедел жады не үшін қажет?",
                "options": ["Бағдарламаларды ұзақ сақтау үшін", "Процесті баяулату үшін", "Уақытша сақтау үшін", "Сақтау құрылғысын ауыстыру үшін"],
                "correctAnswer": "Уақытша сақтау үшін"
            },
            {
                question: "Ақпараттың ең кіші өлшем бірлігі:",
                "options": ["Мегабайт", "Бит", "Гигабайт", "Килобайт"],
                "correctAnswer": "Бит"
            },
            {
                question: "Интернет қызметтеріне не жатады?",
                "options": ["Word", "Почта, WWW, FTP", "Paint", "Excel"],
                "correctAnswer": "Почта, WWW, FTP"
            },
            {
                question: "Гиперсілтеме дегеніміз не?",
                "options": ["Сурет", "Түс", "Басқа бетке өтетін сілтеме", "Кесте"],
                "correctAnswer": "Басқа бетке өтетін сілтеме"
            },
            {
                question: "Компьютерлік этика дегеніміз не?",
                "options": ["Бағдарлама түрі", "Қауіпсіздік құралы", "Компьютермен дұрыс жұмыс істеу ережесі", "Дыбыс шығару әдісі"],
                "correctAnswer": "Компьютермен дұрыс жұмыс істеу ережесі"
            },
            {
                question: "Ақпараттың өлшем бірліктері:",
                "options": ["Секунд, минут", "Километр, метр", "Бит, байт", "Градус, радиан"],
                "correctAnswer": "Бит, байт"
            },
            {
                question: "Файл дегеніміз не?",
                "options": ["Компьютер", "Программа", "Ақпараттар жиынтығы", "Экран"],
                "correctAnswer": "Ақпараттар жиынтығы"
            },
            {
                question: "Scratch бағдарламасы не үшін қажет?",
                "options": ["Сурет салу", "Код жазу", "Графикалық ойындар жасау", "Мәтін теру"],
                "correctAnswer": "Графикалық ойындар жасау"
            },
            {
                question: "Алгоритм дегеніміз не?",
                "options": ["Компьютер", "Мәлімет", "Әрекеттер тізбегі", "Графика"],
                "correctAnswer": "Әрекеттер тізбегі"
            },
            {
                question: "Қай құрылғы енгізу құрылғысы болып табылады?",
                "options": ["Принтер", "Сканер", "Монитор", "Динамик"],
                "correctAnswer": "Сканер"
            },
            {
                question: "Программа не үшін керек?",
                "options": ["Музыка тыңдау үшін", "Компьютермен әрекеттесу үшін", "Кескін салу үшін", "Файл жою үшін"],
                "correctAnswer": "Компьютермен әрекеттесу үшін"
            },
            {
                question: "Компьютерлік вирустар не істей алады?",
                "options": ["Компьютерді тездетеді", "Компьютерді қорғап тұрады", "Файлдарды бүлдіреді", "Байланысты жақсартады"],
                "correctAnswer": "Файлдарды бүлдіреді"
            },
            {
                question: "Компьютердің қатты дискі қайда орналасады?",
                "options": ["Монитормен бірге", "Сыртта", "Жүйелік блок ішінде", "Пернетақтада"],
                "correctAnswer": "Жүйелік блок ішінде"
            }
        ]
    },
    // 7-сынып
    {
        class: 7,
        testNumber: 1,
        questions: [
            {
                question: "Компьютердің ең негізгі құрылғысы:",
                options: ["Принтер", "Жүйелік блок", "Тінтуір", "Монитор"],
                correctAnswer: "Жүйелік блок"
            },
            {
                question: "Ақпаратты ең ұзақ уақыт сақтайтын құрылғы:",
                options: ["Жедел жад", "Қатқыл диск", "Процессор", "Монитор"],
                correctAnswer: "Қатқыл диск"
            },
            {
                question: "«Байт» нені білдіреді?",
                options: ["4 бит", "8 бит", "16 бит", "1 бит"],
                correctAnswer: "8 бит"
            },
            {
                question: "Гиперсілтеме деген не?",
                options: ["Құжатты сақтау әдісі", "Басқа бетке өтуді қамтамасыз ететін элемент", "Программа", "Графикалық элемент"],
                correctAnswer: "Басқа бетке өтуді қамтамасыз ететін элемент"
            },
            {
                question: "Интернетке қосылу үшін не қажет?",
                options: ["Компьютер", "Принтер", "Модем", "Сканер"],
                correctAnswer: "Модем"
            },
            {
                question: "Paint бағдарламасының қызметі:",
                options: ["Презентация жасау", "Графикалық сурет салу", "Мәтін теру", "Видео көру"],
                correctAnswer: "Графикалық сурет салу"
            },
            {
                question: "Ақпараттың өлшем бірлігі:",
                options: ["Килограмм", "Метр", "Бит", "Секунд"],
                correctAnswer: "Бит"
            },
            {
                question: "Пернетақтада Enter пернесінің қызметі:",
                options: ["Қате жою", "Жаңа жолға көшу", "Жою", "Файл ашу"],
                correctAnswer: "Жаңа жолға көшу"
            },
            {
                question: "Принтердің қызметі:",
                "options": ["Ақпаратты енгізу", "Ақпаратты шығару", "Ақпаратты сақтау", "Ақпаратты жою"],
                "correctAnswer": "Ақпаратты шығару"
            },
            {
                "question": "Компьютердің миы қалай аталады?",
                "options": ["Монитор", "Пернетақта", "Процессор", "Дыбыс құрылғысы"],
                "correctAnswer": "Процессор"
            },
            {
                "question": "Электрондық пошта қызметі:",
                "options": ["Сурет салу", "Ақпаратты енгізу", "Хат жіберу және қабылдау", "Презентация жасау"],
                "correctAnswer": "Хат жіберу және қабылдау"
            },
            {
                "question": "Компьютерге пароль қоюдың маңызы:",
                "options": ["Әдемілік үшін", "Қауіпсіздік үшін", "Графика үшін", "Жылдамдық үшін"],
                "correctAnswer": "Қауіпсіздік үшін"
            },
            {
                "question": "Мәтіндік редактордың қызметі:",
                "options": ["Сурет салу", "Мәтін жазу", "Аудио шығару", "Видео өңдеу"],
                "correctAnswer": "Мәтін жазу"
            },
            {
                "question": "Компьютердің қуат көзі:",
                "options": ["Пернетақта", "Жүйелік блок", "Қуат көзі блогы", "Сканер"],
                "correctAnswer": "Қуат көзі блогы"
            },
            {
                "question": "Интернеттегі іздеу жүйесіне мысал:",
                "options": ["Excel", "Windows", "Google", "Paint"],
                "correctAnswer": "Google"
            }
        ]
    },
    {
        class: 7,
        testNumber: 2,
        questions: [
            {
                question: "Компьютердің экраны қалай аталады?",
                options: ["Пернетақта", "Монитор", "Принтер", "Сканер"],
                correctAnswer: "Монитор"
            },
            {
                question: "Пернетақтадағы бос орын пернесі:",
                options: ["Delete", "Shift", "Space", "Ctrl"],
                correctAnswer: "Space"
            },
            {
                question: "Ақпараттың ең кіші өлшем бірлігі:",
                options: ["Кбайт", "Мбайт", "Бит", "Байт"],
                correctAnswer: "Бит"
            },
            {
                question: "Мәтіндік ақпаратты енгізу құрылғысы:",
                options: ["Тінтуір", "Пернетақта", "Монитор", "Дыбыс колонкасы"],
                correctAnswer: "Пернетақта"
            },
            {
                question: "Компьютерге сыртқы құрылғылар қалай жалғанады?",
                options: ["USB арқылы", "Желілік кабель", "Дыбыс кабелі", "Монитор кабелі"],
                correctAnswer: "USB арқылы"
            },
            {
                question: "Құжатты сақтау үшін қандай пәрмен таңдалады?",
                options: ["Save", "Open", "Print", "Exit"],
                correctAnswer: "Save"
            },
            {
                question: "Windows дегеніміз не?",
                options: ["Бағдарлама", "Ойын", "Операциялық жүйе", "Мәтін"],
                correctAnswer: "Операциялық жүйе"
            },
            {
                question: "Компьютер қосылмай тұр. Не тексеру керек?",
                "options": ["Модем", "Электр қуаты", "Принтер", "Қатты диск"],
                "correctAnswer": "Электр қуаты"
            },
            {
                question: "Ақпаратты енгізуге арналған құрылғы:",
                "options": ["Принтер", "Сканер", "Колонка", "Монитор"],
                "correctAnswer": "Сканер"
            },
            {
                "question": "Файл дегеніміз не?",
                "options": ["Программа", "Ақпараттық объект", "Жүйе", "Компьютер құрылғысы"],
                "correctAnswer": "Ақпараттық объект"
            },
            {
                "question": "Браузердің қызметі:",
                "options": ["Файлдарды сақтау", "Сайттарды ашу", "Кесте жасау", "Сурет салу"],
                "correctAnswer": "Сайттарды ашу"
            },
            {
                "question": "Компьютердің жедел жады не үшін қажет?",
                "options": ["Қуат беру", "Ақпаратты уақытша сақтау", "Ақпаратты шығару", "Сурет салу"],
                "correctAnswer": "Ақпаратты уақытша сақтау"
            },
            {
                "question": "Интернет сөзінің мағынасы:",
                "options": ["Ішкі байланыс", "Жаһандық желі", "Электрондық пошта", "Құрылғы"],
                "correctAnswer": "Жаһандық желі"
            },
            {
                "question": "Microsoft Word не үшін қолданылады?",
                "options": ["Сурет салу", "Мәтін жазу", "Видеоны көру", "Әуен тыңдау"],
                "correctAnswer": "Мәтін жазу"
            },
            {
                "question": "Жою пернесі:",
                "options": ["Enter", "Backspace", "Shift", "Esc"],
                "correctAnswer": "Backspace"
            }
        ]
    },
    {
        class: 7,
        testNumber: 3,
        questions: [
            {
                question: "Компьютердің негізгі құрылғыларының бірі:",
                "options": ["Тінтуір", "Принтер", "Сканер", "Монитор"],
                "correctAnswer": "Тінтуір"
            },
            {
                question: "Файлды көшіру үшін қандай команданы қолданамыз?",
                "options": ["Ctrl + V", "Ctrl + C", "Ctrl + X", "Ctrl + Z"],
                "correctAnswer": "Ctrl + C"
            },
            {
                "question": "Ақпараттың өлшем бірлігі:",
                "options": ["Кбайт", "Мбайт", "Гигабайт", "Байт"],
                "correctAnswer": "Байт"
            },
            {
                question: "Paint бағдарламасының қызметі:",
                "options": ["Мәтін жазу", "Сурет салу", "Электрондық хат жазу", "Желі құру"],
                "correctAnswer": "Сурет салу"
            },
            {
                question: "Excel бағдарламасының қызметі:",
                "options": ["Мәтіндік редактор", "Кестелік мәліметтерді өңдеу", "Сурет салу", "Видеоны көру"],
                "correctAnswer": "Кестелік мәліметтерді өңдеу"
            },
            {
                question: "Компьютердің қай құрылғысы ақпаратты енгізуге арналған?",
                "options": ["Принтер", "Тінтуір", "Монитор", "Пернетақта"],
                "correctAnswer": "Пернетақта"
            },
            {
                question: "Интернеттің бір бөлігі ретінде не қолданамыз?",
                "options": ["Мәтіндік редактор", "Веб-браузер", "Құжат редакторы", "Электрондық кесте"],
                "correctAnswer": "Веб-браузер"
            },
            {
                question: "Ақпаратты шығаратын құрылғы:",
                "options": ["Пернетақта", "Жүйелік блок", "Монитор", "Сканер"],
                "correctAnswer": "Монитор"
            },
            {
                question: "Компьютердің жүйелік блогы не үшін керек?",
                "options": ["Ақпарат сақтау", "Ақпаратты өңдеу", "Сурет салу", "Желі жасау"],
                "correctAnswer": "Ақпаратты өңдеу"
            },
            {
                question: "Microsoft PowerPoint бағдарламасы үшін қолданылатын негізгі мақсат:",
                "options": ["Мәтін теру", "Презентация жасау", "График құру", "Электронды хат жазу"],
                "correctAnswer": "Презентация жасау"
            },
            {
                question: "Операциялық жүйенің қызметі:",
                "options": ["Бағдарламаны сақтау", "Бағдарламаны іске қосу", "Тек басып шығару", "Әуен ойнау"],
                "correctAnswer": "Бағдарламаны іске қосу"
            },
            {
                question: "Интернеттегі іздеу жүйесі не үшін қажет?",
                "options": ["Веб-бет ашу", "Ақпарат іздеу", "Программа орнату", "Файлды сақтау"],
                "correctAnswer": "Ақпарат іздеу"
            },
            {
                question: "Компьютерде жұмыс істеу кезінде не маңызды?",
                "options": ["Жылдамдық", "Қауіпсіздік", "Сурет", "Дыбыс"],
                "correctAnswer": "Қауіпсіздік"
            },
            {
                question: "Қазіргі уақытта ең көп қолданылатын браузер:",
                "options": ["Word", "Internet Explorer", "Google Chrome", "Excel"],
                "correctAnswer": "Google Chrome"
            },
            {
                question: "Компьютерде сөздерді тексеру қызметі:",
                "options": ["Сөздік", "Орфографиялық тексеруші", "Графика", "Кесте"],
                "correctAnswer": "Орфографиялық тексеруші"
            }
        ]
    },
    {
        class: 7,
        testNumber: 4,
        questions: [
            {
                question: "Файлды ашу үшін қандай команда қолданылады?",
                "options": ["Ctrl + O", "Ctrl + S", "Ctrl + N", "Ctrl + P"],
                "correctAnswer": "Ctrl + O"
            },
            {
                question: "Компьютердің қай бөлігіндегі мәліметтер өңделеді?",
                "options": ["Қатқыл диск", "Жедел жад", "Процессор", "Жүйелік блок"],
                "correctAnswer": "Процессор"
            },
            {
                question: "Мәтінмен жұмыс істейтін негізгі құрылғы:",
                "options": ["Тінтуір", "Пернетақта", "Сканер", "Принтер"],
                "correctAnswer": "Пернетақта"
            },
            {
                question: "Веб-браузердің қызметі:",
                "options": ["Программаларды орнату", "Сайттарды ашу", "Сурет салу", "Мәтін теру"],
                "correctAnswer": "Сайттарды ашу"
            },
            {
                question: "Word бағдарламасында мәтіннің шрифтін өзгерту үшін қандай әрекет жасаймыз?",
                "options": ["Мәтінді тінтуірмен ерекшелеп, шрифт мәзірінен таңдау", "Мәтінді көшіріп алу", "Мәтінді жай ғана теру", "Құжатты сақтау"],
                "correctAnswer": "Мәтінді тінтуірмен ерекшелеп, шрифт мәзірінен таңдау"
            },
            {
                question: "Қатты диск не үшін қажет?",
                "options": ["Бағдарламаларды орнату", "Ақпаратты сақтау", "Принтерді қосу", "Сурет салу"],
                "correctAnswer": "Ақпаратты сақтау"
            },
            {
                question: "Мәтін жазу үшін қандай бағдарлама қажет?",
                "options": ["Paint", "Microsoft Word", "PowerPoint", "Excel"],
                "correctAnswer": "Microsoft Word"
            },
            {
                question: "Ақпаратты сығу үшін қандай формат қолданылады?",
                "options": [".jpg", ".zip", ".exe", ".doc"],
                "correctAnswer": ".zip"
            },
            {
                question: "Дыбыстық сигналды шығару құрылғысы:",
                "options": ["Принтер", "Дыбыс колонкасы", "Тінтуір", "Сканер"],
                "correctAnswer": "Дыбыс колонкасы"
            },
            {
                question: "Windows жүйесінде файлды қайда сақтауға болады?",
                "options": ["Жүйелік қате", "Жүйелік қалта", "Файлдар каталогы", "Электрондық почта"],
                "correctAnswer": "Файлдар каталогы"
            },
            {
                question: "Құжаттың сақталатын форматы қандай болады?",
                "options": [".jpg", ".mp3", ".doc", ".html"],
                "correctAnswer": ".doc"
            },
            {
                question: "Компьютерде есептеулер жасау үшін қандай бағдарлама қолданылады?",
                "options": ["Paint", "Microsoft Excel", "Word", "PowerPoint"],
                "correctAnswer": "Microsoft Excel"
            },
            {
                question: "Желі арқылы ақпарат жіберу қызметі:",
                "options": ["Электрондық пошта", "Сурет салу", "Принтерден шығару", "Видеоны көру"],
                "correctAnswer": "Электрондық пошта"
            },
            {
                question: "Интернетті пайдалану үшін қандай құрылғы қажет?",
                "options": ["Модем", "Принтер", "Дыбыс колонкасы", "Пернетақта"],
                "correctAnswer": "Модем"
            },
            {
                question: "Бағдарламаның қысқаша атауы:",
                "options": ["URL", "URL", "IP", "HTTP"],
                "correctAnswer": "URL"
            }
        ]
    },
    {
        class: 7,
        testNumber: 5,
        questions: [
            {
                question: "Компьютердің қай құрылғысы сурет салуға арналған?",
                "options": ["Тінтуір", "Принтер", "Сканер", "Графикалық планшет"],
                "correctAnswer": "Графикалық планшет"
            },
            {
                question: "Word бағдарламасында файлды қайда сақтауға болады?",
                "options": ["Жұмыс үстелі", "Желілік диск", "Қатты диск", "Мобильді құрылғы"],
                "correctAnswer": "Жұмыс үстелі"
            },
            {
                question: "Компьютердің пернетақтасында үлкен әріптерді жазу үшін қандай перне қолданылады?",
                "options": ["Shift", "Ctrl", "Caps Lock", "Enter"],
                "correctAnswer": "Shift"
            },
            {
                question: "Файлдарды қай жерден көруге болады?",
                "options": ["Картриджден", "Қатты диск пен жұмыс үстелінен", "Пернетақтадан", "Экраннан"],
                "correctAnswer": "Қатты диск пен жұмыс үстелінен"
            },
            {
                question: "Paint бағдарламасында сурет салу үшін қандай құралдар қолданамыз?",
                "options": ["Сурет салу құралдары", "Мәтін теру құралдары", "Аудио өңдеу құралдары", "Құжат сақтаушы құралдар"],
                "correctAnswer": "Сурет салу құралдары"
            },
            {
                question: "Желі арқылы деректерді жіберу үшін қолданылатын құрылғы:",
                "options": ["Модем", "Принтер", "Сканер", "Монитор"],
                "correctAnswer": "Модем"
            },
            {
                question: "Excel бағдарламасының қызметі:",
                "options": ["Мәтін теру", "Кестелерді өңдеу", "Сурет салу", "Видео қарау"],
                "correctAnswer": "Кестелерді өңдеу"
            },
            {
                question: "Файлды ашу үшін қандай пернелер тіркесімін қолданамыз?",
                "options": ["Ctrl + O", "Ctrl + N", "Ctrl + P", "Ctrl + S"],
                "correctAnswer": "Ctrl + O"
            },
            {
                question: "Ақпаратты сақтайтын құрылғы:",
                "options": ["Монитор", "Қатқыл диск", "Принтер", "Дыбыс колонкасы"],
                "correctAnswer": "Қатқыл диск"
            },
            {
                question: "Ақпаратты өшіру үшін қай перне қолданылады?",
                    "options": ["Delete", "Enter", "Space", "Backspace"],
    "correctAnswer": "Delete"
},
{
    question: "Дыбысты өңдеу бағдарламасы:",
        "options": ["Word", "Excel", "Sound Recorder", "PowerPoint"],
    "correctAnswer": "Sound Recorder"
},
{
    question: "Компьютердің қай бөлігінде процессор орналасқан?",
        "options": ["Жүйелік блок", "Сканер", "Принтер", "Модем"],
    "correctAnswer": "Жүйелік блок"
},
{
    question: "Тізімдерді жасау үшін қандай құрал қолданылады?",
    "options": ["Таблицы", "Блокнот", "Тізімдер панелі", "Мәтін теру құралдары"],
    "correctAnswer": "Тізімдер панелі"
},
{
    question: "Мәтіндік құжатта мәтінді қай пернемен таңдаймыз?",
        "options": ["Ctrl + A", "Ctrl + C", "Ctrl + V", "Ctrl + Z"],
    "correctAnswer": "Ctrl + A"
},
{
    question: "Интернетте сөйлесу үшін қолданылатын бағдарлама:",
        "options": ["Электрондық пошта", "Skype", "Google Chrome", "Microsoft Word"],
    "correctAnswer": "Skype"
}
]
},
{
    class: 7,
    testNumber: 6,
    questions: [
    {
        question: "Компьютердің қай бөлігінде ақпарат сақталады?",
        "options": ["Процессор", "Қатты диск", "Сканер", "Принтер"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Компьютердегі қатты диск не үшін қажет?",
        "options": ["Ақпаратты шығару", "Ақпаратты сақтау", "Ақпаратты өңдеу", "Ақпаратты енгізу"],
        "correctAnswer": "Ақпаратты сақтау"
    },
    {
        question: "Paint бағдарламасында файлды қайда сақтаймыз?",
        "options": ["Қатты диск", "Тінтуір", "Желілік диск", "Пернетақта"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Операциялық жүйе деген не?",
        "options": ["Бағдарламаны орнату", "Құжатты сақтау", "Жүйенің негізгі басқарушы бағдарламасы", "Ақпаратты өңдеу"],
        "correctAnswer": "Жүйенің негізгі басқарушы бағдарламасы"
    },
    {
        question: "Мәтіндерді өңдеу үшін қандай бағдарлама қолданылады?",
        "options": ["Microsoft Word", "Excel", "PowerPoint", "Paint"],
        "correctAnswer": "Microsoft Word"
    },
    {
        question: "Принтердің қызметі:",
        "options": ["Ақпаратты шығару", "Ақпаратты сақтау", "Ақпаратты өңдеу", "Ақпаратты енгізу"],
        "correctAnswer": "Ақпаратты шығару"
    },
    {
        question: "Кестелерді құрастыру үшін қолданылатын бағдарлама:",
        "options": ["Word", "PowerPoint", "Excel", "Paint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Компьютердің қай бөлігінде жад бар?",
        "options": ["Процессор", "Қатты диск", "Жедел жад", "Модем"],
        "correctAnswer": "Жедел жад"
    },
    {
        question: "Ақпаратты өңдеу үшін қандай бағдарлама қолданамыз?",
        "options": ["Microsoft Excel", "PowerPoint", "Paint", "Word"],
        "correctAnswer": "Microsoft Excel"
    },
    {
        question: "Интернетті пайдалану үшін қандай құрылғы қажет?",
        "options": ["Модем", "Принтер", "Сканер", "Колонка"],
        "correctAnswer": "Модем"
    },
    {
        question: "Мәтіндерді теру үшін қандай құрал қолданылады?",
        "options": ["Пернетақта", "Модем", "Сканер", "Тінтуір"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Қатқыл диск не үшін қажет?",
        "options": ["Мәтіндер жазу", "Ақпаратты сақтау", "Модем арқылы қосылу", "Принтерді басу"],
        "correctAnswer": "Ақпаратты сақтау"
    },
    {
        question: "Excel бағдарламасында кесте құру үшін қандай құралды қолданамыз?",
        "options": ["Кесте құрастыру құралы", "Мәтін құрастыру", "Сурет салу", "Дыбыс жазу"],
        "correctAnswer": "Кесте құрастыру құралы"
    },
    {
        question: "Интернеттің артықшылығы:",
        "options": ["Жоғары жылдамдықта жұмыс жасау", "Құжаттарды сақтау", "Мәтіндер теру", "Суреттер жасау"],
        "correctAnswer": "Жоғары жылдамдықта жұмыс жасау"
    },
    {
        question: "Программа дегеніміз не?",
        "options": ["Ақпаратты өңдеу құралы", "Құрылғы", "Интернет", "Ақпарат сақтау"],
        "correctAnswer": "Ақпаратты өңдеу құралы"
    }
]
},
{
    class: 7,
    testNumber: 7,
    questions: [
    {
        question: "Компьютердің басты құрылғысы:",
        "options": ["Тінтуір", "Жүйелік блок", "Принтер", "Монитор"],
        "correctAnswer": "Жүйелік блок"
    },
    {
        question: "Мәтін теру үшін қолданылатын құрылғы:",
        "options": ["Сканер", "Пернетақта", "Принтер", "Дыбыс колонкасы"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Құжатты сақтау үшін қандай команда қолданылады?",
        "options": ["Ctrl + S", "Ctrl + O", "Ctrl + P", "Ctrl + N"],
        "correctAnswer": "Ctrl + S"
    },
    {
        question: "Файлды жою үшін қандай перне қолданылады?",
        "options": ["Delete", "Shift", "Enter", "Ctrl"],
        "correctAnswer": "Delete"
    },
    {
        question: "Компьютерде жазбаларды сақтау үшін қолданылатын құрылғы:",
        "options": ["Принтер", "Қатты диск", "Монитор", "Модем"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Интернеттің мәні:",
        "options": ["Веб-бет ашу", "Ғаламдық желі арқылы ақпарат алмасу", "Ақпаратты өңдеу", "Сурет салу"],
        "correctAnswer": "Ғаламдық желі арқылы ақпарат алмасу"
    },
    {
        question: "Мәтіндермен жұмыс істейтін бағдарлама:",
        "options": ["Excel", "Word", "PowerPoint", "Paint"],
        "correctAnswer": "Word"
    },
    {
        question: "Модемнің қызметі:",
        "options": ["Желі арқылы ақпарат жіберу", "Сурет салу", "Дыбыс жазу", "Программа орнату"],
        "correctAnswer": "Желі арқылы ақпарат жіберу"
    },
    {
        question: "Мәтінді қайта жазу үшін қандай перне қолданылады?",
        "options": ["Ctrl + Z", "Ctrl + C", "Ctrl + V", "Ctrl + P"],
        "correctAnswer": "Ctrl + Z"
    },
    {
        question: "Құжатты басып шығару үшін қай перне қолданылады?",
        "options": ["Ctrl + P", "Ctrl + N", "Ctrl + S", "Ctrl + V"],
        "correctAnswer": "Ctrl + P"
    },
    {
        question: "Мәтінді көшіру үшін қандай перне тіркесімін қолданамыз?",
        "options": ["Ctrl + C", "Ctrl + V", "Ctrl + X", "Ctrl + Z"],
        "correctAnswer": "Ctrl + C"
    },
    {
        question: "Программаны орнату үшін қай құрылғыны қолданамыз?",
        "options": ["Сканер", "CD диск", "Принтер", "Модем"],
        "correctAnswer": "CD диск"
    },
    {
        question: "Компьютердің қосалқы құрылғысы:",
        "options": ["Монитор", "Принтер", "Процессор", "Тінтуір"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Интернетті қолдану үшін қандай құрылғы қажет?",
        "options": ["Модем", "Сканер", "Принтер", "Колонка"],
        "correctAnswer": "Модем"
    },
    {
        question: "Бағдарлама не үшін қолданылады?",
        "options": ["Ақпаратты сақтау", "Ақпаратты өңдеу", "Ақпаратты шығару", "Ақпаратты енгізу"],
        "correctAnswer": "Ақпаратты өңдеу"
    }
]
},
// 8-сынып
{
    class: 8,
    testNumber: 1,
    questions: [
    {
        question: "Компьютердің негізгі бөлігі қайсысы?",
        "options": ["Жүйелік блок", "Принтер", "Сканер", "Монитор"],
        "correctAnswer": "Жүйелік блок"
    },
    {
        question: "Операциялық жүйе қандай қызмет атқарады?",
        "options": ["Бағдарламаны орнатады", "Ақпаратты сақтайды", "Бағдарламаларды басқаруды қамтамасыз етеді", "Электрондық хат жібереді"],
        "correctAnswer": "Бағдарламаларды басқаруды қамтамасыз етеді"
    },
    {
        question: "Ақпараттың өлшем бірлігі қайсысы?",
        "options": ["Кбайт", "Гигабайт", "Мбайт", "Байт"],
        "correctAnswer": "Байт"
    },
    {
        question: "Интернетте сайтты ашу үшін қандай құрал қолданылады?",
        "options": ["Веб-браузер", "Электрондық пошта", "Принтер", "Сканер"],
        "correctAnswer": "Веб-браузер"
    },
    {
        question: "Компьютерлік вирус не істейді?",
        "options": ["Ақпаратты қорғауға көмектеседі", "Программаларды жояды", "Интернетке қосылады", "Мәліметтерді сақтайды"],
        "correctAnswer": "Программаларды жояды"
    },
    {
        question: "Интернетті қолдану үшін не қажет?",
        "options": ["Модем", "Принтер", "Колонка", "Монитор"],
        "correctAnswer": "Модем"
    },
    {
        question: "Мәтіндік құжатта қандай кеңейту форматы болады?",
        "options": [".doc", ".jpg", ".zip", ".exe"],
        "correctAnswer": ".doc"
    },
    {
        question: "Желі арқылы деректерді жіберу үшін қандай құрылғы қажет?",
        "options": ["Модем", "Принтер", "Тінтуір", "Клавиатура"],
        "correctAnswer": "Модем"
    },
    {
        question: "Ақпаратты өңдеуге арналған негізгі құрылғы:",
        "options": ["Процессор", "Монитор", "Сканер", "Жедел жад"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Ақпаратты сақтау үшін қандай құрылғы қажет?",
        "options": ["Процессор", "Қатты диск", "Принтер", "Сканер"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Мәтін жазу үшін қандай бағдарлама қолданылады?",
        "options": ["Paint", "Word", "Excel", "PowerPoint"],
        "correctAnswer": "Word"
    },
    {
        question: "Бағдарламаны іске қосу үшін қандай команда қолданылады?",
        "options": ["Ctrl + O", "Ctrl + S", "Ctrl + N", "Ctrl + R"],
        "correctAnswer": "Ctrl + R"
    },
    {
        question: "Компьютердегі суреттерді өңдеу үшін қандай бағдарлама қолдануға болады?",
        "options": ["Word", "Excel", "Paint", "PowerPoint"],
        "correctAnswer": "Paint"
    },
    {
        question: "Компьютерде қандай құрылғы ақпаратты енгізуге арналған?",
        "options": ["Тінтуір", "Пернетақта", "Принтер", "Сканер"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Компьютерде жұмыс істеу кезінде не маңызды?",
        "options": ["Жылдамдық", "Қауіпсіздік", "Сурет", "Дыбыс"],
        "correctAnswer": "Қауіпсіздік"
    }
]
},
{
    class: 8,
    testNumber: 2,
    questions: [
    {
        question: "Excel бағдарламасында кестені қандай форматта сақтау керек?",
        "options": [".doc", ".xlsx", ".jpg", ".mp3"],
        "correctAnswer": ".xlsx"
    },
    {
        question: "Windows жүйесінде қандай кеңейту форматы қолданылады?",
        "options": [".exe", ".jpg", ".zip", ".mp3"],
        "correctAnswer": ".exe"
    },
    {
        question: "Компьютердің қай құрылғысы ақпаратты шығарады?",
        "options": ["Сканер", "Принтер", "Тінтуір", "Пернетақта"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Қандай бағдарламамен кестелер мен диаграммаларды құруға болады?",
        "options": ["Excel", "PowerPoint", "Paint", "Word"],
        "correctAnswer": "Excel"
    },
    {
        question: "Программаны жою үшін қандай әрекет жасау керек?",
        "options": ["Пуск → Бағдарлама → Жою", "Бағдарламаны тек көшіру", "Бағдарламаны құру", "Бағдарламаны іске қосу"],
        "correctAnswer": "Пуск → Бағдарлама → Жою"
    },
    {
        question: "Бағдарламадағы деректерді қайда сақтау керек?",
        "options": ["Қатты диск", "Пернетақта", "Жедел жад", "Монитор"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Интернет арқылы файлдарды жіберу үшін қай қызмет қолданылады?",
        "options": ["Skype", "Электрондық пошта", "Веб-браузер", "PowerPoint"],
        "correctAnswer": "Электрондық пошта"
    },
    {
        question: "Кесте құру үшін қандай бағдарламаны қолданамыз?",
        "options": ["Excel", "PowerPoint", "Word", "Paint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Компьютердің қай құрылғысы ақпаратты енгізу үшін қолданылады?",
        "options": ["Тінтуір", "Пернетақта", "Монитор", "Принтер"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Компьютердің жадын басқару үшін қандай құрылғы қолданылады?",
        "options": ["Процессор", "Монитор", "Принтер", "Сканер"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Қандай файл форматындағы бейнемазмұнды көруге болады?",
        "options": [".avi", ".zip", ".exe", ".mp3"],
        "correctAnswer": ".avi"
    },
    {
        question: "Мәтіндерді теру үшін қандай құрылғы қолданылады?",
        "options": ["Сканер", "Пернетақта", "Принтер", "Дыбыс колонкасы"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Жаңа терезе ашу үшін қандай перне тіркесімі қолданылады?",
        "options": ["Ctrl + N", "Ctrl + S", "Ctrl + P", "Ctrl + O"],
        "correctAnswer": "Ctrl + N"
    },
    {
        question: "Компьютердегі ақпараттың көлемін өлшеу үшін қандай бірлік қолданылады?",
        "options": ["Килобайт", "Секунд", "Мбит", "Сантиметр"],
        "correctAnswer": "Килобайт"
    },
    {
        question: "Қандай құрылғы компьютердің шығару құрылғысы болып табылады?",
        "options": ["Монитор", "Пернетақта", "Сканер", "Модем"],
        "correctAnswer": "Монитор"
    }
]
},
{
    class: 8,
    testNumber: 3,
    questions: [
    {
        question: "Деректерді қалай қауіпсіз сақтауға болады?",
        "options": ["Қатты диск пайдалану", "Қосымша резервтік көшірме жасау", "Жұмыс үстеліне сақтау", "Ақпаратты желіде сақтау"],
        "correctAnswer": "Қосымша резервтік көшірме жасау"
    },
    {
        question: "Компьютердің қай бөлігінде процессор орналасады?",
        "options": ["Жедел жад", "Жүйелік блок", "Монитор", "Пернетақта"],
        "correctAnswer": "Жүйелік блок"
    },
    {
        question: "Интернетте жұмыс істеу үшін қандай құрылғы қажет?",
        "options": ["Модем", "Принтер", "Тінтуір", "Процессор"],
        "correctAnswer": "Модем"
    },
    {
        question: "Ақпаратты сақтаудың қандай түрі бар?",
        "options": ["Жергілікті сақтау", "Қашықтықтан сақтау", "Виртуалды сақтау", "Құрылғыдағы сақтау"],
        "correctAnswer": "Қашықтықтан сақтау"
    },
    {
        question: "Бағдарлама ішінде іздеу үшін қандай құрал қолданылады?",
        "options": ["Панель", "Іздеу жолағы", "Басты мәзір", "Тінтуір"],
        "correctAnswer": "Іздеу жолағы"
    },
    {
        question: "Excel бағдарламасында диаграмма жасау үшін қандай құралды қолданамыз?",
        "options": ["Деректерді енгізу", "Диаграмма қосу", "Құжатты сақтау", "Мәтін теру"],
        "correctAnswer": "Диаграмма қосу"
    },
    {
        question: "Қандай бағдарлама мәтіндік құжаттармен жұмыс істейді?",
        "options": ["Paint", "Word", "Excel", "PowerPoint"],
        "correctAnswer": "Word"
    },
    {
        question: "Компьютердің негізгі құрылғысы қандай?",
        "options": ["Процессор", "Принтер", "Монитор", "Тінтуір"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Компьютерде деректерді сақтау үшін не қолданылады?",
        "options": ["Жад картасы", "Қатты диск", "Модем", "Принтер"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Операциялық жүйенің қызметі қандай?",
        "options": ["Бағдарламаларды басқару", "Ақпаратты сақтау", "Сурет салу", "Мәтін теру"],
        "correctAnswer": "Бағдарламаларды басқару"
    },
    {
        question: "Кесте түрінде мәліметтерді өңдейтін бағдарлама:",
        "options": ["PowerPoint", "Excel", "Word", "Paint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Ақпаратты көшіру үшін қандай команда қолданылады?",
        "options": ["Ctrl + C", "Ctrl + V", "Ctrl + X", "Ctrl + S"],
        "correctAnswer": "Ctrl + C"
    },
    {
        question: "Мәтінмен жұмыс істейтін бағдарлама:",
        "options": ["Excel", "PowerPoint", "Word", "Paint"],
        "correctAnswer": "Word"
    },
    {
        question: "Windows жүйесінде файлды ашу үшін қандай пернелер тіркесімі қолданылады?",
        "options": ["Ctrl + O", "Ctrl + N", "Ctrl + P", "Ctrl + S"],
        "correctAnswer": "Ctrl + O"
    },
    {
        question: "Қандай құрылғы компьютердің шығару құрылғысы болып табылады?",
        "options": ["Принтер", "Тінтуір", "Монитор", "Сканер"],
        "correctAnswer": "Принтер"
    }
]
},
{
    class: 8,
    testNumber: 4,
    questions: [
    {
        question: "Компьютердің қандай құрылғысы ақпаратты енгізуге арналған?",
        "options": ["Сканер", "Монитор", "Тінтуір", "Принтер"],
        "correctAnswer": "Тінтуір"
    },
    {
        question: "Қандай компьютерлік бағдарлама мәтіндермен жұмыс істейді?",
        "options": ["Excel", "Word", "Paint", "PowerPoint"],
        "correctAnswer": "Word"
    },
    {
        question: "Компьютердің қай құрылғысы ақпаратты шығарады?",
        "options": ["Принтер", "Тінтуір", "Пернетақта", "Сканер"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Бағдарламаның негізгі функциясы қандай?",
        "options": ["Мәліметтерді өңдеу", "Интернетке қосылу", "Құжаттарды сақтау", "Жүйені басқару"],
        "correctAnswer": "Мәліметтерді өңдеу"
    },
    {
        question: "Электрондық пошта арқылы хабарлама жіберу үшін не қажет?",
        "options": ["Модем", "Сканер", "Принтер", "Картридж"],
        "correctAnswer": "Модем"
    },
    {
        question: "Құжаттағы мәтінді қалай сақтау керек?",
        "options": ["Ctrl + N", "Ctrl + S", "Ctrl + P", "Ctrl + V"],
        "correctAnswer": "Ctrl + S"
    },
    {
        question: "Электрондық поштаның қай бөлімі хабарлама жібереді?",
        "options": ["Қабылдаушы", "Жіберуші", "Тақырып", "Деректер"],
        "correctAnswer": "Жіберуші"
    },
    {
        question: "Суреттер мен бейнемазмұнды өңдеуге арналған бағдарлама?",
        "options": ["Word", "Excel", "Paint", "PowerPoint"],
        "correctAnswer": "Paint"
    },
    {
        question: "Қай файл кеңейтімі бейнемазмұн үшін қолданылады?",
        "options": [".exe", ".avi", ".txt", ".jpg"],
        "correctAnswer": ".avi"
    },
    {
        question: "Принтермен қалай жұмыс істеу керек?",
        "options": ["Құжатты электрондық пошта арқылы жіберу", "Принтерге қосу", "Құжатты сақтап қою", "Бағдарламаны жаңарту"],
        "correctAnswer": "Принтерге қосу"
    },
    {
        question: "Компьютердің негізгі компоненттерінің бірі не?",
        "options": ["Қатты диск", "Монитор", "Принтер", "Тінтуір"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Word бағдарламасында кесте қалай жасалады?",
        "options": ["Insert → Table", "File → Save", "Edit → Copy", "View → Grid"],
        "correctAnswer": "Insert → Table"
    },
    {
        question: "Тікелей интернеттен мәлімет алу үшін қандай құралды қолданамыз?",
        "options": ["Электрондық пошта", "Веб-браузер", "Принтер", "Монитор"],
        "correctAnswer": "Веб-браузер"
    },
    {
        question: "Excel бағдарламасында қандай кеңейту форматы қолданылады?",
        "options": [".doc", ".jpg", ".xlsx", ".mp3"],
        "correctAnswer": ".xlsx"
    },
    {
        question: "Компьютерлік вирус не істейді?",
        "options": ["Бағдарламаларды орнатады", "Ақпаратты қорғайды", "Құжаттарды басып шығарады", "Бағдарламаларды жояды"],
        "correctAnswer": "Бағдарламаларды жояды"
    }
]
},
{
    class: 8,
    testNumber: 5,
    questions: [
    {
        question: "Операциялық жүйе не үшін қажет?",
        "options": ["Компьютердің барлық компоненттерін басқару", "Интернетті қосу", "Бағдарламаларды орнату", "Мәтіндермен жұмыс істеу"],
        "correctAnswer": "Компьютердің барлық компоненттерін басқару"
    },
    {
        question: "Қандай құрылғы ақпаратты енгізуге арналған?",
        "options": ["Монитор", "Принтер", "Пернетақта", "Тінтуір"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Excel бағдарламасында қандай типтегі деректермен жұмыс істеуге болады?",
        "options": ["Мәтіндер", "Сандар", "Бейнемазмұн", "Барлық жауаптар дұрыс"],
        "correctAnswer": "Барлық жауаптар дұрыс"
    },
    {
        question: "Бейнемазмұнды өңдеу үшін қандай бағдарлама қолданылады?",
        "options": ["PowerPoint", "Word", "Paint", "Video Editor"],
        "correctAnswer": "Video Editor"
    },
    {
        question: "Құжатты қандай форматта сақтау керек?",
        "options": [".txt", ".pdf", ".jpg", ".exe"],
        "correctAnswer": ".pdf"
    },
    {
        question: "Word бағдарламасында қандай құралмен мәтіннің стилін өзгертуге болады?",
        "options": ["Font → Style", "File → Save", "Insert → Table", "View → Zoom"],
        "correctAnswer": "Font → Style"
    },
    {
        question: "Желі арқылы файлдармен алмасу үшін не қажет?",
        "options": ["Модем", "Сканер", "Принтер", "Монитор"],
        "correctAnswer": "Модем"
    },
    {
        question: "Компьютердегі қандай құрылғы ақпаратты өңдеуге арналған?",
        "options": ["Процессор", "Қатты диск", "Тінтуір", "Пернетақта"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Бағдарламаны ашу үшін қандай перне тіркесімі қолданылады?",
        "options": ["Ctrl + O", "Ctrl + P", "Ctrl + N", "Ctrl + S"],
        "correctAnswer": "Ctrl + O"
    },
    {
        question: "Ақпаратты қауіпсіз сақтау үшін не қажет?",
        "options": ["Жедел жад", "Қатты диск", "Монитор", "Тінтуір"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Желіде деректерді қорғау үшін не қажет?",
        "options": ["Құпия сөз", "Электрондық пошта", "Принтер", "Тінтуір"],
        "correctAnswer": "Құпия сөз"
    },
    {
        question: "Құжаттағы мәтіннің мөлшерін өзгерту үшін қандай әрекет жасалады?",
        "options": ["Font → Size", "File → Open", "View → Zoom", "Insert → Picture"],
        "correctAnswer": "Font → Size"
    },
    {
        question: "Компьютерде файлды ашу үшін қандай пернелер тіркесімі пайдаланылады?",
        "options": ["Ctrl + A", "Ctrl + S", "Ctrl + O", "Ctrl + P"],
        "correctAnswer": "Ctrl + O"
    },
    {
        question: "Монитордың қызметі қандай?",
        "options": ["Ақпаратты сақтайды", "Ақпаратты шығарады", "Ақпаратты өңдейді", "Ақпаратты енгізеді"],
        "correctAnswer": "Ақпаратты шығарады"
    },
    {
        question: "Ақпаратты сақтау үшін компьютердің қай құрылғысы пайдаланылады?",
        "options": ["Жедел жад", "Қатты диск", "Процессор", "Сканер"],
        "correctAnswer": "Қатты диск"
    }
]
},
{
    class: 8,
    testNumber: 6,
    questions: [
    {
        question: "Компьютердің қандай құрылғысы деректерді өңдеуге арналған?",
        "options": ["Процессор", "Монитор", "Пернетақта", "Принтер"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Қай бағдарламамен деректерді кесте түрінде сақтау үшін жұмыс істейміз?",
        "options": ["PowerPoint", "Excel", "Word", "Paint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Компьютерде деректердің қауіпсіздігін сақтау үшін не қажет?",
        "options": ["Құпия сөз", "Электрондық пошта", "Принтер", "Тінтуір"],
        "correctAnswer": "Құпия сөз"
    },
    {
        question: "Қай құрылғы компьютерге ақпарат енгізуге арналған?",
        "options": ["Пернетақта", "Тінтуір", "Принтер", "Сканер"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Құжатты басып шығару үшін қандай құрылғы қажет?",
        "options": ["Принтер", "Модем", "Жад картасы", "Қатты диск"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Желі арқылы файлдармен алмасу үшін қай қызметті қолданамыз?",
        "options": ["Веб-браузер", "Электрондық пошта", "Skype", "Paint"],
        "correctAnswer": "Электрондық пошта"
    },
    {
        question: "Қай файл кеңейтімін қолданғанда суреттер ашылады?",
        "options": [".jpg", ".txt", ".mp3", ".zip"],
        "correctAnswer": ".jpg"
    },
    {
        question: "Құжатты сақтауға арналған формат қайсысы?",
        "options": [".txt", ".pdf", ".docx", ".exe"],
        "correctAnswer": ".pdf"
    },
    {
        question: "Excel бағдарламасында диаграмма жасау үшін не қажет?",
        "options": ["Insert → Chart", "File → Save", "Edit → Copy", "View → Zoom"],
        "correctAnswer": "Insert → Chart"
    },
    {
        question: "Компьютердің жедел жадын басқару үшін қандай құрылғы қажет?",
        "options": ["Процессор", "Жедел жад", "Қатты диск", "Тінтуір"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Кесте түріндегі деректерді сақтау үшін қандай бағдарламаны қолданамыз?",
        "options": ["Excel", "Word", "PowerPoint", "Paint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Мәтіндермен жұмыс істейтін бағдарлама қайсысы?",
        "options": ["Excel", "PowerPoint", "Word", "Paint"],
        "correctAnswer": "Word"
    },
    {
        question: "Қай құрылғы ақпаратты енгізуге арналған?",
        "options": ["Принтер", "Тінтуір", "Монитор", "Процессор"],
        "correctAnswer": "Тінтуір"
    },
    {
        question: "Ақпаратты интернет арқылы жіберу үшін не қажет?",
        "options": ["Модем", "Сканер", "Тінтуір", "Принтер"],
        "correctAnswer": "Модем"
    },
    {
        question: "Бағдарламаларды қосу үшін қандай перне тіркесімі пайдаланылады?",
        "options": ["Ctrl + O", "Ctrl + P", "Ctrl + N", "Ctrl + S"],
        "correctAnswer": "Ctrl + O"
    }
]
},
{
    class: 8,
    testNumber: 7,
    questions: [
    {
        question: "Ақпаратты сақтау үшін қандай құрылғы пайдаланылады?",
        "options": ["Пернетақта", "Қатты диск", "Процессор", "Монитор"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Excel бағдарламасында деректердің қандай түрімен жұмыс істей аламыз?",
        "options": ["Мәтіндер", "Сандар", "Бейнемазмұн", "Барлық жауаптар дұрыс"],
        "correctAnswer": "Сандар"
    },
    {
        question: "Құжатты сақтаудың қандай форматы мәтіндік құжат үшін пайдаланылады?",
        "options": [".txt", ".mp3", ".docx", ".exe"],
        "correctAnswer": ".txt"
    },
    {
        question: "Қай құрылғы ақпаратты енгізуге арналған?",
        "options": ["Принтер", "Тінтуір", "Монитор", "Процессор"],
        "correctAnswer": "Тінтуір"
    },
    {
        question: "Қай бағдарламамен кесте түрінде деректерді сақтауға болады?",
        "options": ["Word", "Paint", "Excel", "PowerPoint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Интернеттен ақпарат алу үшін қандай құралды қолданамыз?",
        "options": ["Веб-браузер", "Электрондық пошта", "Принтер", "Skype"],
        "correctAnswer": "Веб-браузер"
    },
    {
        question: "Құжатты қалай басып шығарамыз?",
        "options": ["Ctrl + S", "Ctrl + P", "Ctrl + O", "Ctrl + N"],
        "correctAnswer": "Ctrl + P"
    },
    {
        question: "Қандай құрылғы ақпаратты шығарады?",
        "options": ["Принтер", "Тінтуір", "Пернетақта", "Монитор"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Қандай бағдарламамен бейнемазмұнды өңдеуге болады?",
        "options": ["Word", "Excel", "Video Editor", "PowerPoint"],
        "correctAnswer": "Video Editor"
    },
    {
        question: "Құжатта әріптер мен сандардың мөлшерін өзгерту үшін қандай құралды қолданамыз?",
        "options": ["Font → Style", "Font → Size", "View → Zoom", "Insert → Table"],
        "correctAnswer": "Font → Size"
    },
    {
        question: "Компьютердің негізгі компоненттерінің бірі не?",
        "options": ["Жедел жад", "Процессор", "Қатты диск", "Тінтуір"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Суреттермен жұмыс істейтін бағдарлама қайсысы?",
        "options": ["Excel", "Word", "Paint", "PowerPoint"],
        "correctAnswer": "Paint"
    },
    {
        question: "Электрондық пошта арқылы хабарлама жіберу үшін қандай құрылғы қажет?",
        "options": ["Модем", "Сканер", "Принтер", "Монитор"],
        "correctAnswer": "Модем"
    },
    {
        question: "Компьютердің қандай құрылғысы ақпаратты енгізуге арналған?",
        "options": ["Принтер", "Пернетақта", "Тінтуір", "Сканер"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Ақпаратты қорғау үшін компьютерде қандай шаралар қолдану керек?",
        "options": ["Құпия сөз", "Принтер", "Тінтуір", "Сканер"],
        "correctAnswer": "Құпия сөз"
    }
]
},
// 9-сынып
{
    class: 9,
    testNumber: 1,
    questions: [
    {
        question: "Компьютердің қандай құрылғысы деректерді өңдеуге арналған?",
        "options": ["Процессор", "Монитор", "Пернетақта", "Тінтуір"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Қандай компьютерлік бағдарлама мәтіндермен жұмыс істейді?",
        "options": ["Excel", "Word", "PowerPoint", "Paint"],
        "correctAnswer": "Word"
    },
    {
        question: "Компьютерлік вирус қандай қызмет атқарады?",
        "options": ["Бағдарламаларды орнатады", "Бағдарламаларды жояды", "Желімен қосылады", "Ақпаратты қорғайды"],
        "correctAnswer": "Бағдарламаларды жояды"
    },
    {
        question: "Қандай құрылғы деректерді шығару үшін қолданылады?",
        "options": ["Принтер", "Тінтуір", "Жедел жад", "Процессор"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Электрондық поштаны жіберу үшін қандай қосымша қажет?",
        "options": ["Модем", "Веб-браузер", "Почта клиенті", "Сканер"],
        "correctAnswer": "Почта клиенті"
    },
    {
        question: "Word бағдарламасында мәтіннің түстігін қалай өзгертуге болады?",
        "options": ["Font → Color", "Edit → Copy", "File → Open", "View → Zoom"],
        "correctAnswer": "Font → Color"
    },
    {
        question: "Excel бағдарламасында ұяшықтың шекарасын қалай қоюға болады?",
        "options": ["Format → Borders", "Insert → Table", "Edit → Delete", "File → Save"],
        "correctAnswer": "Format → Borders"
    },
    {
        question: "Қандай құрылғы компьютердің ақпаратын сақтайды?",
        "options": ["Қатты диск", "Жедел жад", "Процессор", "Тінтуір"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Құжатты қағазға басып шығару үшін қандай әрекет қажет?",
        "options": ["Ctrl + P", "Ctrl + S", "Ctrl + O", "Ctrl + N"],
        "correctAnswer": "Ctrl + P"
    },
    {
        question: "Excel бағдарламасында қандай кеңейту форматы пайдаланылады?",
        "options": [".xlsx", ".exe", ".txt", ".html"],
        "correctAnswer": ".xlsx"
    },
    {
        question: "Құжатты электрондық пошта арқылы жіберу үшін не қажет?",
        "options": ["Модем", "Сканер", "Электрондық пошта клиенті", "Принтер"],
        "correctAnswer": "Электрондық пошта клиенті"
    },
    {
        question: "Компьютерлік желі дегеніміз не?",
        "options": ["Бірнеше компьютердің бірігуі", "Бір компьютердің өзі", "Интернет", "Бағдарламалардың жиынтығы"],
        "correctAnswer": "Бірнеше компьютердің бірігуі"
    },
    {
        question: "Қай құрылғы мәліметтерді енгізу үшін қолданылады?",
        "options": ["Тінтуір", "Пернетақта", "Принтер", "Монитор"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Компьютердің негізгі бөлігі не?",
        "options": ["Пернетақта", "Тінтуір", "Процессор", "Қатты диск"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Электрондық поштаны жіберу үшін қандай файл кеңейтілімін қолданамыз?",
        "options": [".jpg", ".pdf", ".docx", ".eml"],
        "correctAnswer": ".eml"
    }
]
},
{
    class: 9,
    testNumber: 2,
    questions: [
    {
        question: "Қай файл кеңейтімін қолданғанда бейнемазмұн ашылады?",
        "options": [".mp3", ".jpg", ".avi", ".exe"],
        "correctAnswer": ".avi"
    },
    {
        question: "Компьютердің қай құрылғысы ақпаратты енгізуге арналған?",
        "options": ["Принтер", "Монитор", "Пернетақта", "Процессор"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Сканердің қызметі қандай?",
        "options": ["Ақпаратты басып шығару", "Ақпаратты енгізу", "Ақпаратты сақтау", "Ақпаратты өңдеу"],
        "correctAnswer": "Ақпаратты енгізу"
    },
    {
        question: "Қандай құрылғы компьютердің сыртқы құрылғысы болып табылады?",
        "options": ["Қатты диск", "Монитор", "Принтер", "Процессор"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Ақпаратты қағазға басып шығару үшін қандай құрылғы қажет?",
        "options": ["Сканер", "Принтер", "Пернетақта", "Тінтуір"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Электрондық пошта арқылы хабарламаны қалай жіберуге болады?",
        "options": ["Модем арқылы", "Почта клиенті арқылы", "Сканер арқылы", "Принтер арқылы"],
        "correctAnswer": "Почта клиенті арқылы"
    },
    {
        question: "Желі арқылы мәліметтерді алу үшін қандай құралды қолданамыз?",
        "options": ["Модем", "Принтер", "Тінтуір", "Сканер"],
        "correctAnswer": "Модем"
    },
    {
        question: "Веб-браузер арқылы қандай қызметтерді орындауға болады?",
        "options": ["Хабарламаларды жіберу", "Веб-беттерді қарау", "Құжаттарды басып шығару", "Электрондық пошта жіберу"],
        "correctAnswer": "Веб-беттерді қарау"
    },
    {
        question: "Қандай файл кеңейтімі бейнемазмұн үшін қолданылады?",
        "options": [".mp4", ".jpg", ".exe", ".txt"],
        "correctAnswer": ".mp4"
    },
    {
        question: "Желіде ақпарат алмасу үшін не қажет?",
        "options": ["Модем", "Тінтуір", "Принтер", "Монитор"],
        "correctAnswer": "Модем"
    },
    {
        question: "Құжатты басып шығару үшін не істеу керек?",
        "options": ["Ctrl + P", "Ctrl + O", "Ctrl + S", "Ctrl + N"],
        "correctAnswer": "Ctrl + P"
    },
    {
        question: "Компьютердің қандай құрылғысы деректерді сақтауға арналған?",
        "options": ["Қатты диск", "Сканер", "Тінтуір", "Монитор"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Компьютерде не іске қосылады?",
        "options": ["Бағдарламалар", "Веб-сайттар", "Пошта", "Құжаттар"],
        "correctAnswer": "Бағдарламалар"
    },
    {
        question: "Компьютерлік вирус қандай әрекеттерді орындауы мүмкін?",
        "options": ["Ақпаратты қорғау", "Бағдарламаларды орнату", "Құжаттарды жою", "Жүйені жаңарту"],
        "correctAnswer": "Құжаттарды жою"
    },
    {
        question: "Құжатты сақтау үшін қандай перне тіркесімі пайдаланылады?",
        "options": ["Ctrl + N", "Ctrl + S", "Ctrl + P", "Ctrl + O"],
        "correctAnswer": "Ctrl + S"
    }
]
},
{
    class: 9,
    testNumber: 3,
    questions: [
    {
        question: "Сканер не істейді?",
        "options": ["Ақпаратты шығарады", "Ақпаратты енгізеді", "Ақпаратты сақтайды", "Ақпаратты өңдейді"],
        "correctAnswer": "Ақпаратты енгізеді"
    },
    {
        question: "Деректерді компьютерге енгізу үшін қандай құрылғы қолданылады?",
        "options": ["Тінтуір", "Пернетақта", "Принтер", "Монитор"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Құжатты сақтау үшін қандай перне тіркесімі пайдаланылады?",
        "options": ["Ctrl + N", "Ctrl + S", "Ctrl + P", "Ctrl + O"],
        "correctAnswer": "Ctrl + S"
    },
    {
        question: "Ақпаратты қауіпсіз сақтау үшін қандай құрылғы қажет?",
        "options": ["Жедел жад", "Қатты диск", "Принтер", "Тінтуір"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Компьютерде қандай құрылғы ақпаратты шығарады?",
        "options": ["Принтер", "Тінтуір", "Пернетақта", "Монитор"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Электрондық пошта арқылы хабарлама жіберу үшін қандай бағдарлама қажет?",
        "options": ["Веб-браузер", "Почта клиенті", "Сканер", "Тінтуір"],
        "correctAnswer": "Почта клиенті"
    },
    {
        question: "Желі арқылы ақпарат алу үшін қай құрылғы қажет?",
        "options": ["Модем", "Сканер", "Принтер", "Тінтуір"],
        "correctAnswer": "Модем"
    },
    {
        question: "Желіде деректерді қорғау үшін не қажет?",
        "options": ["Құпия сөз", "Модем", "Принтер", "Тінтуір"],
        "correctAnswer": "Құпия сөз"
    },
    {
        question: "Интернет арқылы ақпарат алу үшін қандай құрал қолданамыз?",
        "options": ["Модем", "Тінтуір", "Принтер", "Жедел жад"],
        "correctAnswer": "Модем"
    },
    {
        question: "Компьютерлік вирус не істейді?",
        "options": ["Ақпаратты қорғау", "Құжаттарды жою", "Бағдарламаларды орнату", "Жүйені басқару"],
        "correctAnswer": "Құжаттарды жою"
    },
    {
        question: "Веб-браузер не істейді?",
        "options": ["Веб-беттерді қарау", "Электрондық пошта жіберу", "Құжаттарды сақтау", "Принтерге басып шығару"],
        "correctAnswer": "Веб-беттерді қарау"
    },
    {
        question: "Қандай құрылғы мәліметтерді өңдейді?",
        "options": ["Процессор", "Тінтуір", "Принтер", "Сканер"],
        "correctAnswer": "Процессор"
    },
    {
        question: "Қай кеңейту форматы деректерді сақтау үшін қолданылады?",
        "options": [".txt", ".pdf", ".jpg", ".mp3"],
        "correctAnswer": ".pdf"
    },
    {
        question: "Құжатты сақтау үшін қандай формат пайдаланылады?",
        "options": [".txt", ".doc", ".jpg", ".mp3"],
        "correctAnswer": ".doc"
    },
    {
        question: "Сканердің қызметі қандай?",
        "options": ["Ақпаратты енгізу", "Ақпаратты өңдеу", "Ақпаратты сақтау", "Ақпаратты шығару"],
        "correctAnswer": "Ақпаратты енгізу"
    }
]
},
{
    class: 9,
    testNumber: 4,
    questions: [
    {
        question: "Қандай құрылғыны қолданғанда ғана компьютерге деректер енгізуге болады?",
        "options": ["Монитор", "Тінтуір", "Пернетақта", "Принтер"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Көшірілген мәліметтер қайда сақталады?",
        "options": ["Қатты диск", "Буферге", "Жедел жад", "Процессор"],
        "correctAnswer": "Буферге"
    },
    {
        question: "Excel бағдарламасында неше түрлі сілтеме бар?",
        "options": ["1", "2", "3", "4"],
        "correctAnswer": "3"
    },
    {
        question: "Қандай кеңейту форматы мәтіндерді сақтау үшін пайдаланылады?",
        "options": [".txt", ".doc", ".jpg", ".avi"],
        "correctAnswer": ".txt"
    },
    {
        question: "HTML дегеніміз не?",
        "options": ["Веб-бетті құрастыру тілі", "Операциялық жүйе", "Бағдарламалау тілі", "Дерекқор жүйесі"],
        "correctAnswer": "Веб-бетті құрастыру тілі"
    },
    {
        question: "Қай бағдарламаның көмегімен кестелер жасалады?",
        "options": ["Word", "Excel", "Paint", "PowerPoint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Интернетті қауіпсіз пайдалану үшін қандай құралды қолдану керек?",
        "options": ["Антивирус", "Модем", "Сканер", "Принтер"],
        "correctAnswer": "Антивирус"
    },
    {
        question: "Электрондық пошта арқылы файлды жіберу үшін қандай кеңейту форматы қажет?",
        "options": [".exe", ".txt", ".jpg", ".zip"],
        "correctAnswer": ".zip"
    },
    {
        question: "Қандай құрал интернет арқылы мәліметтерді жіберуге мүмкіндік береді?",
        "options": ["Модем", "Принтер", "Сканер", "Тінтуір"],
        "correctAnswer": "Модем"
    },
    {
        question: "Қандай файл түрі графикалық кескіндерді сақтау үшін қолданылады?",
        "options": [".txt", ".jpg", ".mp3", ".exe"],
        "correctAnswer": ".jpg"
    },
    {
        question: "Бірнеше компьютерді бір-бірімен байланыстыратын құрылғы?",
        "options": ["Маршрутизатор", "Принтер", "Модем", "Тінтуір"],
        "correctAnswer": "Маршрутизатор"
    },
    {
        question: "Қандай құрал деректерді басып шығаруға арналған?",
        "options": ["Принтер", "Тінтуір", "Пернетақта", "Қатты диск"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Интернет арқылы қандай қызметтер қолданылады?",
        "options": ["Электрондық пошта", "Принтерлеу", "Модем", "Сканер"],
        "correctAnswer": "Электрондық пошта"
    },
    {
        question: "Компьютердегі бағдарламалар не істейді?",
        "options": ["Мәліметтерді қорғауға көмектеседі", "Мәліметтерді сақтайды", "Мәліметтерді өңдейді", "Мәліметтерді басып шығарады"],
        "correctAnswer": "Мәліметтерді өңдейді"
    },
    {
        question: "Веб-беттерді қарау үшін қандай құралды қолданамыз?",
        "options": ["Веб-браузер", "Веб-сервер", "Веб-қосымша", "Веб-дизайнер"],
        "correctAnswer": "Веб-браузер"
    }
]
},
{
    class: 9,
    testNumber: 5,
    questions: [
    {
        question: "Компьютердің қай құрылғысы сурет салуға арналған?",
        "options": ["Тінтуір", "Принтер", "Сканер", "Графикалық планшет"],
        "correctAnswer": "Графикалық планшет"
    },
    {
        question: "Word бағдарламасында файлды қайда сақтауға болады?",
        "options": ["Жұмыс үстелі", "Желілік диск", "Қатты диск", "Мобильді құрылғы"],
        "correctAnswer": "Жұмыс үстелі"
    },
    {
        question: "Компьютердің пернетақтасында үлкен әріптерді жазу үшін қандай перне қолданылады?",
        "options": ["Shift", "Ctrl", "Caps Lock", "Enter"],
        "correctAnswer": "Shift"
    },
    {
        question: "Файлдарды қай жерден көруге болады?",
        "options": ["Картриджден", "Қатты диск пен жұмыс үстелінен", "Пернетақтадан", "Экраннан"],
        "correctAnswer": "Қатты диск пен жұмыс үстелінен"
    },
    {
        question: "Paint бағдарламасында сурет салу үшін қандай құралдар қолданамыз?",
        "options": ["Сурет салу құралдары", "Мәтін теру құралдары", "Аудио өңдеу құралдары", "Құжат сақтаушы құралдар"],
        "correctAnswer": "Сурет салу құралдары"
    },
    {
        question: "Желі арқылы деректерді жіберу үшін қолданылатын құрылғы:",
        "options": ["Модем", "Принтер", "Сканер", "Монитор"],
        "correctAnswer": "Модем"
    },
    {
        question: "Excel бағдарламасының қызметі:",
        "options": ["Мәтін теру", "Кестелерді өңдеу", "Сурет салу", "Видео қарау"],
        "correctAnswer": "Кестелерді өңдеу"
    },
    {
        question: "Файлды ашу үшін қандай пернелер тіркесімін қолданамыз?",
        "options": ["Ctrl + O", "Ctrl + N", "Ctrl + P", "Ctrl + S"],
        "correctAnswer": "Ctrl + O"
    },
    {
        question: "Ақпаратты сақтайтын құрылғы:",
        "options": ["Монитор", "Қатқыл диск", "Принтер", "Дыбыс колонкасы"],
        "correctAnswer": "Қатқыл диск"
    },
    {
        question: "Ақпаратты өшіру үшін қай перне қолданылады?",
        "options": ["Delete", "Enter", "Space", "Backspace"],
        "correctAnswer": "Delete"
    },
    {
        question: "Дыбысты өңдеу бағдарламасы:",
        "options": ["Word", "Excel", "Sound Recorder", "PowerPoint"],
        "correctAnswer": "Sound Recorder"
    },
    {
        question: "Компьютердің қай бөлігінде процессор орналасқан?",
        "options": ["Жүйелік блок", "Сканер", "Принтер", "Модем"],
        "correctAnswer": "Жүйелік блок"
    },
    {
        question: "Тізімдерді жасау үшін қандай құрал қолданылады?",
        "options": ["Таблицы", "Блокнот", "Тізімдер панелі", "Мәтін теру құралдары"],
        "correctAnswer": "Тізімдер панелі"
    },
    {
        question: "Мәтіндік құжатта мәтінді қай пернемен таңдаймыз?",
        "options": ["Ctrl + A", "Ctrl + C", "Ctrl + V", "Ctrl + Z"],
        "correctAnswer": "Ctrl + A"
    },
    {
        question: "Интернетте сөйлесу үшін қолданылатын бағдарлама:",
        "options": ["Электрондық пошта", "Skype", "Google Chrome", "Microsoft Word"],
        "correctAnswer": "Skype"
    }
]
},
{
    class: 9,
    testNumber: 6,
    questions: [
    {
        question: "Компьютердің қай бөлігінде ақпарат сақталады?",
        "options": ["Процессор", "Қатты диск", "Сканер", "Принтер"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Компьютердегі қатты диск не үшін қажет?",
        "options": ["Ақпаратты шығару", "Ақпаратты сақтау", "Ақпаратты өңдеу", "Ақпаратты енгізу"],
        "correctAnswer": "Ақпаратты сақтау"
    },
    {
        question: "Paint бағдарламасында файлды қайда сақтаймыз?",
        "options": ["Қатты диск", "Тінтуір", "Желілік диск", "Пернетақта"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Операциялық жүйе деген не?",
        "options": ["Бағдарламаны орнату", "Құжатты сақтау", "Жүйенің негізгі басқарушы бағдарламасы", "Ақпаратты өңдеу"],
        "correctAnswer": "Жүйенің негізгі басқарушы бағдарламасы"
    },
    {
        question: "Мәтіндерді өңдеу үшін қандай бағдарлама қолданылады?",
        "options": ["Microsoft Word", "Excel", "PowerPoint", "Paint"],
        "correctAnswer": "Microsoft Word"
    },
    {
        question: "Принтердің қызметі:",
        "options": ["Ақпаратты шығару", "Ақпаратты сақтау", "Ақпаратты өңдеу", "Ақпаратты енгізу"],
        "correctAnswer": "Ақпаратты шығару"
    },
    {
        question: "Кестелерді құрастыру үшін қолданылатын бағдарлама:",
        "options": ["Word", "PowerPoint", "Excel", "Paint"],
        "correctAnswer": "Excel"
    },
    {
        question: "Компьютердің қай бөлігінде жад бар?",
        "options": ["Процессор", "Қатты диск", "Жедел жад", "Модем"],
        "correctAnswer": "Жедел жад"
    },
    {
        question: "Ақпаратты өңдеу үшін қандай бағдарлама қолданамыз?",
        "options": ["Microsoft Excel", "PowerPoint", "Paint", "Word"],
        "correctAnswer": "Microsoft Excel"
    },
    {
        question: "Интернетті пайдалану үшін қандай құрылғы қажет?",
        "options": ["Модем", "Принтер", "Сканер", "Колонка"],
        "correctAnswer": "Модем"
    },
    {
        question: "Мәтіндерді теру үшін қандай құрал қолданылады?",
        "options": ["Пернетақта", "Модем", "Сканер", "Тінтуір"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Қатқыл диск не үшін қажет?",
        "options": ["Мәтіндер жазу", "Ақпаратты сақтау", "Модем арқылы қосылу", "Принтерді басу"],
        "correctAnswer": "Ақпаратты сақтау"
    },
    {
        question: "Excel бағдарламасында кесте құру үшін қандай құралды қолданамыз?",
        "options": ["Кесте құрастыру құралы", "Мәтін құрастыру", "Сурет салу", "Дыбыс жазу"],
        "correctAnswer": "Кесте құрастыру құралы"
    },
    {
        question: "Интернеттің артықшылығы:",
        "options": ["Жоғары жылдамдықта жұмыс жасау", "Құжаттарды сақтау", "Мәтіндер теру", "Суреттер жасау"],
        "correctAnswer": "Жоғары жылдамдықта жұмыс жасау"
    },
    {
        question: "Программа дегеніміз не?",
        "options": ["Ақпаратты өңдеу құралы", "Құрылғы", "Интернет", "Ақпарат сақтау"],
        "correctAnswer": "Ақпаратты өңдеу құралы"
    }
]
},
{
    class: 9,
    testNumber: 7,
    questions: [
    {
        question: "Компьютердің басты құрылғысы:",
        "options": ["Тінтуір", "Жүйелік блок", "Принтер", "Монитор"],
        "correctAnswer": "Жүйелік блок"
    },
    {
        question: "Мәтін теру үшін қолданылатын құрылғы:",
        "options": ["Сканер", "Пернетақта", "Принтер", "Дыбыс колонкасы"],
        "correctAnswer": "Пернетақта"
    },
    {
        question: "Құжатты сақтау үшін қандай команда қолданылады?",
        "options": ["Ctrl + S", "Ctrl + O", "Ctrl + P", "Ctrl + N"],
        "correctAnswer": "Ctrl + S"
    },
    {
        question: "Файлды жою үшін қандай перне қолданылады?",
        "options": ["Delete", "Shift", "Enter", "Ctrl"],
        "correctAnswer": "Delete"
    },
    {
        question: "Компьютерде жазбаларды сақтау үшін қолданылатын құрылғы:",
        "options": ["Принтер", "Қатты диск", "Монитор", "Модем"],
        "correctAnswer": "Қатты диск"
    },
    {
        question: "Интернеттің мәні:",
        "options": ["Веб-бет ашу", "Ғаламдық желі арқылы ақпарат алмасу", "Ақпаратты өңдеу", "Сурет салу"],
        "correctAnswer": "Ғаламдық желі арқылы ақпарат алмасу"
    },
    {
        question: "Мәтіндермен жұмыс істейтін бағдарлама:",
        "options": ["Excel", "Word", "PowerPoint", "Paint"],
        "correctAnswer": "Word"
    },
    {
        question: "Модемнің қызметі:",
        "options": ["Желі арқылы ақпарат жіберу", "Сурет салу", "Дыбыс жазу", "Программа орнату"],
        "correctAnswer": "Желі арқылы ақпарат жіберу"
    },
    {
        question: "Мәтінді қайта жазу үшін қандай перне қолданылады?",
        "options": ["Ctrl + Z", "Ctrl + C", "Ctrl + V", "Ctrl + P"],
        "correctAnswer": "Ctrl + Z"
    },
    {
        question: "Құжатты басып шығару үшін қай перне қолданылады?",
        "options": ["Ctrl + P", "Ctrl + N", "Ctrl + S", "Ctrl + V"],
        "correctAnswer": "Ctrl + P"
    },
    {
        question: "Мәтінді көшіру үшін қандай перне тіркесімін қолданамыз?",
        "options": ["Ctrl + C", "Ctrl + V", "Ctrl + X", "Ctrl + Z"],
        "correctAnswer": "Ctrl + C"
    },
    {
        question: "Программаны орнату үшін қай құрылғыны қолданамыз?",
        "options": ["Сканер", "CD диск", "Принтер", "Модем"],
        "correctAnswer": "CD диск"
    },
    {
        question: "Компьютердің қосалқы құрылғысы:",
        "options": ["Монитор", "Принтер", "Процессор", "Тінтуір"],
        "correctAnswer": "Принтер"
    },
    {
        question: "Интернетті қолдану үшін қандай құрылғы қажет?",
        "options": ["Модем", "Сканер", "Принтер", "Колонка"],
        "correctAnswer": "Модем"
    },
    {
        question: "Бағдарлама не үшін қолданылады?",
        "options": ["Ақпаратты сақтау", "Ақпаратты өңдеу", "Ақпаратты шығару", "Ақпаратты енгізу"],
        "correctAnswer": "Ақпаратты өңдеу"
    }
    ]
},
    ]

const seedDB = async () => {
    try {
        await Test.deleteMany({});
        await Test.insertMany(testData);
        console.log('Database seeded!');
        process.exit(0);
    } catch (error) {
        console.error('Error seeding database:', error);
        process.exit(1);
    }
};

connectDB().then(async () => {
    await seedDB();
}).catch(err => {
    console.error("Database seeding failed", err);
});